{
    "Bookmarks": "Segnalibri",
    "You can bookmark any page you're on by clicking the star icon (top right)": "Puoi aggiungere un segnalibro a qualsiasi pagina su cui ti trovi facendo clic sull'icona a forma di stella (in alto a destra)",
    "Rename or remove your bookmarks": "Rinomina o elimina i tuoi segnalibri",
    "Edit": "Modifica",
    "My account": "Il mio account",
    "Change Password": "Cambia password",
    "Copy": "Copia",
    "Delete my account": "Elimina il mio account",
    "Scan QR code from the iOS or Android app to connect:": "Per connettersi scansiona il codice QR dall'app iOS o Android:",
    "Or using a barcode scanner scan to view MyElectric graph": "Oppure utilizza uno scanner di codici a barre per visualizzare il grafico MyElectric",
    "My Profile": "Il mio profilo",
    "Please update your database": "Si prega di aggiornare il tuo database",
    "Preference Saved": "Impostazioni salvate",
    "Problem saving Preferences": "Errore durante il salvataggio delle impostazioni",
    "Invalid parameters": "Parametri non corretti",
    "Error getting data": "Errore durante l'acquisizione di dati",
    "Empty": "Vuoto",
    "Add Bookmark": "Aggiungi Segnalibro",
    "Apps": "Applicazioni",
    "Username must only contain a-z 0-9 dash and underscore, if you created an account before this rule was in place enter your username without the non a-z 0-9 dash underscore characters to login and feel free to change your username on the profile page.": "Il Nome utente deve contenere solo i caratteri a-z e 0-9 . e _ se è stato creato un account prima di questa regola, all'accesso, inserire il nome utente senza i caratteri non validi, poi sentitevi liberi di modificare il nome utente nella pagina del profilo.",
    "Incorrect password, if you're sure it's correct try clearing your browser cache": "Password errata, se si è certi che sia corretta provare a cancellare la cache del browser",
    "Please update database": "Si prega di aggiornare il database"
}