Repository: emoncms/emoncms
Catalog: Modules/eventp/locale/*/LC_MESSAGES/eventp_messages.po
Languages: ru_ru

source: If rate >=, skip next
ru_ru: Если скорость >=, пропустить следующее

source: Conditional - Event
ru_ru: Условие - Событие

source: <p>If value from last process has an absolute change from previous time it was calculated higher or equal to the specified value, processlist execution will skip the next process.</p>
ru_ru: <p>Если значение из последнего процесса имеет абсолютное изменение по сравнению с предыдущим, больше или равно указанному значению, следующий процесс из списка будет пропущен. </p>

source: If rate <, skip next
ru_ru: Если скорость <, пропустить следующее

source: <p>If value from last process has an absolute change from previous time it was calculated lower than the specified value, processlist execution will skip the next process.</p>
ru_ru: <p>Если значение из последнего процесса имеет абсолютное изменение по сравнению с предыдущим, меньше указанного значения, следующий процесс из списка будет пропущен. </p>

source: If Mute, skip next
ru_ru: Если Беззвучный, пропустить следующее

source: <p>A time elapsed dependent condition, first time a processlist passes here the flow is unchanged. Next times the same processlist passes here, if the specified value time (in seconds) has not elapsed, flow will skip next process.</p>
ru_ru: <p>Условие, зависящее от истекшего времени: при первом прохождении списка процессов поток не изменяется. В следующий раз, когда тот же список процессов пройдет сюда, если указанное значение времени (в секундах) не истекло, поток пропустит следующий процесс. </p>

source: If !Mute, skip next
ru_ru: Если не Беззвучный, пропустить следующее

source: <p>A time elapsed dependent condition, first time a processlist passes here the flow skips next. Next times the same processlist passes here, if the specified value time (in seconds) has elapsed, flow will skip next process.</p>
ru_ru: <p>Условие, зависящее от истекшего времени: при первом прохождении спискапроцессов поток переходит к следующему. В следующий раз, когда тот жесписок процессов пройдет сюда, если указанное значение времени (в секундах)истекло, поток пропустит следующий процесс.</p>

source: Send Email
ru_ru: Послать Email

source: Event
ru_ru: Событие

source: <p>Send an email to the user with the specified body. Email sent to user's email address or default set in config.</p><p>Supported template tags to customize body: {type}, {id}, {key}, {name}, {node}, {time}, {value}</p><p>Example body text: At {time} your {type} from {node} with key {key} named {name} had value {value}.</p>
ru_ru: <p>Послать письмо пользователю с указанным содержимым. Письмо послано на адресс пользователя или адресс по умолчанию в настройках. </p><p>Поддерживаемые теги шаблона {type}, {id}, {key}, {name}, {node}, {time}, {value}</p><p>Пример содержимого письма: В {time} ваш {type} с {node} с ключом {key} названным {name} имеет значение {value}.</p>
