{
    "Feeds are where your monitoring data is stored. The recommended route for creating feeds is to start by creating inputs (see the inputs tab). Once you have inputs you can either log them straight to feeds or if you want you can add various levels of input processing to your inputs to create things like daily average data or to calibrate inputs before storage. You may want to follow the link as a guide for generating your request.": "Feeds er hvor din monitorerede data er lagret. Det anbefales at du opretter feeds, ved først at oprette inputs (se input-fanen). Når du har oprettet et input kan du enten logge disse direkte til feeds eller du kan tilføje automatisk behandling af dine inputs inden de logges som feeds. Muligvis ønsker du at følge linket for at bruge den som guide til generering af din anmodning.",
    "WARNING deleting a feed is permanent": "ADVARSEL: Sletning af feed er permanent",
    "Are you sure you want to delete this feed?": "Er du sikker på at du ønsker at slette dette feed?",
    "Delete permanently": "Slet permanent",
    "Id": "ID",
    "Engine": "Motor",
    "Public": "Offentlig",
    "Size": "Størrelse",
    "Updated": "Opdateret",
    "Value": "Værdi",
    "Apikey authentication": "APIKEY-autentificering",
    "If you want to call any of the following action's when your not logged in, add an apikey to the URL of your request: &apikey=APIKEY.": "Hvis du ønsker at kalde en af de følgende funktioner når du ikke er logget ind, skal du tilføje din APIKEY til URL'en: \"&apikey=APIKEY\"",
    "Read only:": "Læserettigheder",
    "Read & Write:": "Læse- og skriverettigheder",
    "Html": "HTML",
    "The feed list view": "Feed-visning",
    "This page": "Denne side",
    "To use the json api the request url needs to include .json": "For at benytte JSON-API-kald skal URL'en indeholde \".json\"",
    "returns a list of public feeds made public by the given user.": "returnerer en liste over offentlige funktioner gjort tilgængelige af brugeren",
    "returns the present value of a given feed": "returnerer den nuværende værdi af et feed",
    "returns feed data": "returnerer feed-data",
    "returns histogram data": "returnerer histogram-data",
    "returns kwh consumed in a given power band using histogram data type": "returnerer kWh-forbrug i et givent kW-område baseret på histogram-data",
    "returns id of a feed given by name": "returnerer ID for et given feed baseret på dets navn"
}