{
    "Feeds are where your monitoring data is stored. The recommended route for creating feeds is to start by creating inputs (see the inputs tab). Once you have inputs you can either log them straight to feeds or if you want you can add various levels of input processing to your inputs to create things like daily average data or to calibrate inputs before storage. You may want to follow the link as a guide for generating your request.": "In den Feeds werden die Monitoringdaten gespeichert. Der empfohlene Weg um Feeds anzulegen ist das vorherige Anlegen von Inputs (siehe Inputs Tab). Wenn du Inputs hast kannst du sie loggen",
    "WARNING deleting a feed is permanent": "WARNUNG Feed wird dauerhaft gelöscht",
    "Are you sure you want to delete this feed?": "Bist du sicher, dass du den Feed löschen willst?",
    "Delete permanently": "Dauerhaft gelöscht",
    "Datatype": "Datentyp",
    "Public": "Öffentlich",
    "Size": "Größe",
    "Updated": "Aktualisiert",
    "Value": "Wert",
    "Apikey authentication": "Apikey Authentifikation",
    "If you want to call any of the following action's when your not logged in, add an apikey to the URL of your request: &apikey=APIKEY.": "Wenn du die folgenden Funktionen aufrufen willst ohne eingeloggt zu sein füge den Apikey in deine Request-URL ein: &apikey=APIKEY.",
    "Read only:": "Nur Lesen:",
    "Read & Write:": "Lesen & Schreiben:",
    "The feed list view": "Listenansicht der Feeds",
    "This page": "Diese Seite",
    "To use the json api the request url needs to include .json": "Um die json Api zu nutzen muss der Request include.json enthalten",
    "returns a list of public feeds made public by the given user.": "zeigt öffentliche Feeds vom jeweiligen Benutzer.",
    "returns the present value of a given feed": "zeigt den aktuellen Wert eines Feeds",
    "returns feed data": "zeigt Feeddaten",
    "returns histogram data": "zeigt Histogrammdaten",
    "returns kwh consumed in a given power band using histogram data type": "zeigt verbrauchte Kilowattstunden in einem bestimmten Leistungsbereich mit Hilfe von Histogrammdaten",
    "returns id of a feed given by name": "zeigt die ID eines Feeds anhand des Namens"
}