{
    "Apikey authentication": "Identificación por apikey",
    "If you want to call any of the following actions when your not logged in you have this options to authenticate with the API key:": "Si quiere hacer peticiones a alguna de las siguientes acciones sin estar logueado, tienes estas opciones para autenticarte con la API key:",
    "Append on the URL of your request: &apikey=APIKEY": "Añade a la url de la petición: &apikey=APIKEY",
    "Use POST parameter: \"apikey=APIKEY\"": "Usa el parámetro POST: \"apikey=APIKEY\"",
    "Add the HTTP header: \"Authorization: Bearer APIKEY\"": "Añade la cabecera HTTP:\"Authorization: Bearer APIKEY\"",
    "Read only:": "Acceso de solo lectura:",
    "Read & Write:": "Lectura & Escritura",
    "Html": "HTML",
    "The feed list view": "Vista de la lista de fuentes",
    "This page": "Esta página",
    "To use the json api the request url needs to include .json": "Para usar la api json la URL de la request debe incluir .json",
    "List feeds for autenticated user": "Listar las fuentes para un usuario autentificado",
    "List public feeds for the given user": "Listar las fuentes publicas para el usuario seleccionado",
    "Get feed id by name": "Seleccionar el id de una fuente por nombre",
    "Returns feed data": "Datos de la fuente",
    "Returns histogram data": "Histograma de datos",
    "Returns kwh consumed in a given power band using histogram data type": "kWh consumidos en una banda de potencia usando el tipo de datos histograma",
    "Return total engines size": "Tamaño total de los motores",
    "Virtual feed process actions": "Procesos para la fuente virtual",
    "Feeds are where your monitoring data is stored. The route for creating storage feeds is to start by creating inputs (see the inputs tab). Once you have inputs you can either log them straight to feeds or if you want you can add various levels of input processing to your inputs to create things like daily average data or to calibrate inputs before storage. Alternatively you can create Virtual feeds, this is a special feed that allows you to do post processing on existing storage feeds data, the main advantage is that it will not use additional storage space and you may modify post processing list that gets applyed on old stored data. You may want to follow the link as a guide for generating your request.": "Las fuentes son el lugar donde tus dato recogido son almacenados. La forma de crear fuentes de almacenado es empezar creando entradas (véase la tab Entradas). Una vez que tienes las entradas puedes o bien guardarlas directamente en las fuentes o añadir varios niveles de procesado de la entrada para crear cosas como la media diaria o calibrar las entradas antes del almacenamiento. Alternativamente, e pueden crear fuentes virtuales, un tipo especial que te permite hacer post-procesamiento en fuentes existentes. La principal ventaja de ésto es que no usa espacio extra de guardado y puedes modificar la lista de post-procesos que se aplica en datos antiguamente guardados. Quizás quieras seguir el enlace para guiarte en la generación de tus peticiones.",
    "New virtual feed": "Nueva fuente virtual",
    "Delete permanently": "Borrado permanente",
    "New Virtual Feed": "Nueva Fuente Virtual",
    "Process list": "Lista de procesos",
    "Public": "Público",
    "Datatype": "Tipo de datos",
    "Engine": "Motor",
    "Size": "Tamaño",
    "Updated": "Actualizado",
    "Value": "Valor"
}