{
    "Apikey authentication": "API võtmega tuvastus",
    "If you want to call any of the following action's when your not logged in, add an apikey to the URL of your request: &apikey=APIKEY.": "Kui te soovite kasutada järgmisi funktsioone ilma tuvastamiseta, siis lisage api võti aadressi järele: &apikey=API VÕTI.",
    "Read only:": "Lugemisõigus:",
    "Read & Write:": "Kirjutamis- ja lugemisõigus:",
    "The feed list view": "Voo nimekirja vaade",
    "This page": "See lehekülg",
    "To use the json api the request url needs to include .json": "Et kasutada json api’t, peab päring sisaldama .json kirjet",
    "returns a list of public feeds made public by the given user.": "tagastab nimekirja avalikest voogudest, mis on tehtud antud kasutaja piolt avalikuks.",
    "returns the present value of a given feed": "tagastab valitud voo hetke väärtuse",
    "returns feed data": "tagastab voo andmed",
    "returns histogram data": "tagastab histogrammi andmed",
    "returns kwh consumed in a given power band using histogram data type": "tagastab tarbitud kwh väärtuse soovitud võimsuse juures kasutades histogrammi andmete tüübi",
    "returns id of a feed given by name": "tagastab nime järgi voo id",
    "Feeds are where your monitoring data is stored. The recommended route for creating feeds is to start by creating inputs (see the inputs tab). Once you have inputs you can either log them straight to feeds or if you want you can add various levels of input processing to your inputs to create things like daily average data or to calibrate inputs before storage. You may want to follow the link as a guide for generating your request.": "Voogudes hoitakse monitooringu andmeid. Soovitatav on teha voogusid sisenditest (vaata sisendite lehte). Kui sul on sisendid, siis saad nad suunata kas otse voogu või saab lisada erinevaid tegevusi sisendite jaoks, nagu näiteks päevane keskmine või sisendi kalibreerimine ennem salvestamist. Te võide järgida lingil toodud juhiseid päringute genereerimise kohta.",
    "WARNING deleting a feed is permanent": "HOIATUS! Voo kustutamine on lõplik",
    "Are you sure you want to delete this feed?": "Kas sa oled kindel, et soovid antud voo kustutada?",
    "Delete permanently": "Kustuta jäädavalt",
    "Datatype": "Andmetüüp",
    "Engine": "Mootor",
    "Public": "Avalik",
    "Size": "Suurus",
    "Updated": "Uuendatud",
    "Value": "Väärtus"
}