{
    "If rate >=, skip next": "Se rate > , salta il prossimo",
    "Conditional - Event": "Condizionato - Evento",
    "<p>If value from last process has an absolute change from previous time it was calculated higher or equal to the specified value, processlist execution will skip the next process.<\/p>": "<p>Se il valore dell'ultimo processo presenta una modifica assoluta rispetto alla data precedente, calcolato su un valore superiore o uguale al valore specificato, l'esecuzione dell'elenco processi ignorerà il processo successivo.<\/p>",
    "If rate <, skip next": "Se rate <, salta il prossimo",
    "<p>If value from last process has an absolute change from previous time it was calculated lower than the specified value, processlist execution will skip the next process.<\/p>": "<p>Se il valore dell'ultimo processo presenta una modifica assoluta rispetto alla data precedente, ma viene calcolato in modo inferiore al valore specificato, l'esecuzione dell'elenco di processi ignorerà il processo successivo.<\/p>",
    "If Mute, skip next": "Se Vuoto, salta il prossimo",
    "<p>A time elapsed dependent condition, first time a processlist passes here the flow is unchanged. Next times the same processlist passes here, if the specified value time (in seconds) has not elapsed, flow will skip next process.<\/p>": "<p>Una condizione dipendente tempo trascorso, la prima volta che un elenco di processi passa qui il flusso è invariato. Le volte successive lo stesso elenco di processi passa qui, se il tempo specificato (in secondi) non è trascorso, il flusso salterà il processo successivo.<\/p>",
    "If !Mute, skip next": "Se !Vuoto, salta il prossimo",
    "<p>A time elapsed dependent condition, first time a processlist passes here the flow skips next. Next times the same processlist passes here, if the specified value time (in seconds) has elapsed, flow will skip next process.<\/p>": "<p>Una condizione dipendente tempo trascorso, prima volta che un elenco di processi passa qui il flusso salta successivo. Le volte successive dello stesso elenco di processi passano qui, se il tempo specificato (in secondi) è trascorso, il flusso salterà il processo successivo.<\/p>",
    "Send Email": "Invia Email",
    "Event": "Evento",
    "<p>Send an email to the user with the specified body. Email sent to user's email address or default set in config.<\/p><p>Supported template tags to customize body: {type}, {id}, {key}, {name}, {node}, {time}, {value}<\/p><p>Example body text: At {time} your {type} from {node} with key {key} named {name} had value {value}.<\/p>": "<p>Inviare un messaggio di posta elettronica all'utente con il corpo specificato. Messaggio di posta elettronica inviato all'indirizzo di posta elettronica dell'utente o impostato come predefinito nella configurazione.<\/p><p>Tag di modello supportati per personalizzare il corpo: \"tipo\", \"id\", \"chiave\", \"nome\" , \"nodo\", \"ora\", \"valore\"<\/p><p>Esempio di testo del corpo del corpo: in corrispondenza del nome di tipo, dal nome del nodo, con la chiave \"key\" denominata \"name\" aveva il valore \"value\".<\/p>"
}