{
    "Log to feed": "Cofnodi i ffrwd",
    "Main": "Prif",
    "<p>This processor logs to a timeseries feed which can then be used to explore historic data. This is recommended for logging power, temperature, humidity, voltage and current data.<\/p><p><b>Feed engine:<\/b><ul><li><b>Emoncms Fixed Interval TimeSeries (PHPFina)<\/b> is the recommended feed engine, it is a fixed interval timeseries engine.<\/li><li><b>Emoncms Variable Interval TimeSeries (PHPTimeseries)<\/b> is for data posted at a non regular interval.<\/li><\/ul><\/p><p><b>Feed interval:<\/b> When selecting the feed interval select an interval that is the same as, or longer than the update rate that is set in your monitoring equipment. Setting the interval rate to be shorter than the update rate of the equipment causes un-needed disk space to be used up.<\/p>": "<p>Mae'r prosesydd hwn yn cofnodi i ffrwd cyfres amser y gellir ei ddefnyddio wedyn i archwilio data hanesyddol. Argymhellir hyn ar gyfer cofnodi data pŵer, tymheredd, lleithder, foltedd a cherrynt.<\/p><p><b>Peiriant ffrwd:<\/b><ul><li><b>Emoncms Fixed Interval TimeSeries (PHPFina)<\/b> yw'r peiriant ffrwd a argymhellir, mae'n beiriant cyfres amser cyfnod sefydlog.<\/li><li><b>Emoncms Variable Interval TimeSeries (PHPTimeseries)<\/b> ar gyfer data a bostir ar gyfnod anrheolaidd.<\/li><\/ul><\/p><p><b>Cyfnod ffrwd:<\/b> Wrth ddewis cyfnod y ffrwd, dewiswch gyfnod sy'r un fath â, neu'n hirach na'r gyfradd diweddaru a osodwyd yn eich offer monitro. Mae gosod cyfradd y cyfnod yn fyrrach na chyfradd diweddaru'r offer yn achosi defnydd diangen o ofod disg.<\/p>",
    "x": "x",
    "Calibration": "Graddnodi",
    "<p>Multiplies current value by given constant. This can be useful for calibrating a particular variable on the web rather than by reprogramming hardware.<\/p>": "<p>Yn lluosi'r gwerth presennol â chysonyn penodol. Gall hyn fod yn ddefnyddiol ar gyfer graddnodi newidyn penodol ar y we yn hytrach na thrwy ailraglennu caledwedd.<\/p>",
    "+": "+",
    "<p>Offset current value by given value. This can again be useful for calibrating a particular variable on the web rather than by reprogramming hardware.<\/p>": "<p>Gwyriad gwerth presennol gan werth penodol. Gall hyn eto fod yn ddefnyddiol ar gyfer graddnodi newidyn penodol ar y we yn hytrach na thrwy ailraglennu caledwedd.<\/p>",
    "Power to kWh": "Pŵer i kWh",
    "Power to kWh\/d": "Pŵer i kWh\/d",
    "Power & Energy": "Pŵer ac Ynni",
    "<p>Convert a power value in Watts to a feed that contains an entry for the total energy used each day (kWh\/d)<\/p>": "<p>Trosi gwerth pŵer mewn Watiau i ffrwd sy'n cynnwys cofnod ar gyfer cyfanswm yr ynni a ddefnyddiwyd bob dydd (kWh\/d)<\/p>",
    "x input": "x mewnbwn",
    "Input": "Mewnbwn",
    "<p>Multiplies the current value with the last value from other input as selected from the input list.<\/p>": "<p>Yn lluosi'r gwerth presennol â'r gwerth olaf o fewnbwn arall fel y'i dewiswyd o'r rhestr mewnbwn.<\/p>",
    "Input on-time": "Amser ymlaen mewnbwn",
    "<p>Counts the amount of time that an input is high in each day and logs the result to a feed. Created for counting the number of hours a solar hot water pump is on each day<\/p>": "<p>Yn cyfrif faint o amser mae mewnbwn yn uchel bob dydd ac yn cofnodi'r canlyniad i ffrwd. Wedi'i greu ar gyfer cyfrif nifer yr oriau mae pwmp dŵr poeth solar ymlaen bob dydd<\/p>",
    "Wh increments to kWh\/d": "Crynhoad Wh i kWh\/d",
    "<p>Accumulate Wh measurements into kWh\/d.<p><b>Input<\/b>: energy increments in Wh.<\/p>": "<p>Crynhoi mesuriadau Wh i kWh\/d.<p><b>Mewnbwn<\/b>: cynyddrannau ynni mewn Wh.<\/p>",
    "kWh to kWh\/d (OLD)": "kWh i kWh\/d (HEN)",
    "Deleted": "Wedi'i ddileu",
    "Update feed at day": "Diweddaru ffrwd ar ddiwrnod",
    "<p>Updates or inserts daily value on the specified time (given by the JSON time parameter from the API) of the specified feed<\/p>": "<p>Yn diweddaru neu'n mewnosod gwerth dyddiol ar yr amser penodol (a roddir gan baramedr amser JSON o'r API) o'r ffrwd benodol<\/p>",
    "+ input": "+ mewnbwn",
    "<p>Adds the current value with the last value from other input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Yn ychwanegu'r gwerth presennol â'r gwerth olaf o fewnbwn arall fel y'i dewiswyd o'r rhestr mewnbwn. Mae'r canlyniad yn cael ei basio'n ôl ar gyfer prosesu pellach gan y prosesydd nesaf yn y rhestr brosesu.<\/p>",
    "\/ input": "\/ mewnbwn",
    "<p>Divides the current value with the last value from other input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Yn rhannu'r gwerth presennol â'r gwerth olaf o fewnbwn arall fel y'i dewiswyd o'r rhestr mewnbwn. Mae'r canlyniad yn cael ei basio'n ôl ar gyfer prosesu pellach gan y prosesydd nesaf yn y rhestr brosesu.<\/p>",
    "Phaseshift": "Gwedd-newid",
    "Accumulator": "Crynhowr",
    "Misc": "Amrywiol",
    "<p>Output feed accumulates by input value<\/p>": "<p>Mae ffrwd allbwn yn cronni yn ôl gwerth mewnbwn<\/p>",
    "Rate of change": "Cyfradd newid",
    "<p>Output feed is the difference between the current value and the last<\/p>": "<p>Ffrwd allbwn yw'r gwahaniaeth rhwng y gwerth presennol a'r olaf<\/p>",
    "Histogram": "Histogram",
    "Daily Average": "Cyfartaledd Dyddiol",
    "Heat flux": "Llif gwres",
    "Power gained to kWh\/d": "Pŵer a enillwyd i kWh\/d",
    "Total pulse count to pulse increment": "Cyfanswm cyfrif curiad i gynyddran curiad",
    "Pulse": "Curiad",
    "<p>Returns the number of pulses incremented since the last update for a input that is a cumulative pulse count. i.e If the input updates from 23400 to 23410 the result will be an incremenet of 10.<\/p>": "<p>Yn dychwelyd nifer y curiadau a gynyddwyd ers y diweddariad olaf ar gyfer mewnbwn sy'n gyfrif curiad crynoadol. h.y. Os yw'r mewnbwn yn diweddaru o 23400 i 23410 bydd y canlyniad yn gynyddran o 10.<\/p>",
    "kWh to Power": "kWh i Bŵer",
    "<p>Convert accumulating kWh to instantaneous power<\/p>": "<p>Trosi kWh cronnus i bŵer ar unwaith<\/p>",
    "- input": "- mewnbwn",
    "<p>Subtracts from the current value the last value from other input as selected from the input list.<\/p>": "<p>Yn tynnu o'r gwerth presennol y gwerth olaf o fewnbwn arall fel y'i dewiswyd o'r rhestr mewnbwn.<\/p>",
    "kWh to kWh\/d": "kWh i kWh\/d",
    "<p>Upsert kWh to a daily value.<\/p>": "<p>Upsert kWh i werth dyddiol.<\/p>",
    "Allow positive": "Caniatáu cadarnhaol",
    "Limits": "Terfynau",
    "<p>Negative values are zeroed for further processing by the next processor in the processing list.<\/p>": "<p>Mae gwerthoedd negyddol yn cael eu sero ar gyfer prosesu pellach gan y prosesydd nesaf yn y rhestr brosesu.<\/p>",
    "Allow negative": "Caniatáu negyddol",
    "<p>Positive values are zeroed for further processing by the next processor in the processing list.<\/p>": "<p>Mae gwerthoedd cadarnhaol yn cael eu sero ar gyfer prosesu pellach gan y prosesydd nesaf yn y rhestr brosesu.<\/p>",
    "Signed to unsigned": "Arwyddedig i diarwydd",
    "<p>Convert a number that was interpreted as a 16 bit signed number to an unsigned number.<\/p>": "<p>Trosi rhif a ddehonglwyd fel rhif arwyddedig 16 did i rif diarwydd.<\/p>",
    "Max daily value": "Gwerth dyddiol uchaf",
    "<p>Maximal daily value. Upserts on the selected daily feed the highest value reached each day.<\/p>": "<p>Gwerth dyddiol uchaf. Upserts ar y ffrwd ddyddiol a ddewiswyd y gwerth uchaf a gyrhaeddwyd bob dydd.<\/p>",
    "Min daily value": "Gwerth dyddiol isaf",
    "<p>Minimal daily value. Upserts on the selected daily feed the lowest value reached each day.<\/p>": "<p>Gwerth dyddiol isaf. Upserts ar y ffrwd ddyddiol a ddewiswyd y gwerth isaf a gyrhaeddwyd bob dydd.<\/p>",
    "+ feed": "+ ffrwd",
    "Feed": "Ffrwd",
    "<p>Adds the current value with the last value from a feed as selected from the feed list.<\/p>": "<p>Yn ychwanegu'r gwerth presennol â'r gwerth olaf o ffrwd fel y'i dewiswyd o'r rhestr ffrwdiau.<\/p>",
    "- feed": "- ffrwd",
    "<p>Subtracts from the current value the last value from a feed as selected from the feed list.<\/p>": "<p>Yn tynnu o'r gwerth presennol y gwerth olaf o ffrwd fel y'i dewiswyd o'r rhestr ffrwdiau.<\/p>",
    "* feed": "* ffrwd",
    "<p>Multiplies the current value with the last value from a feed as selected from the feed list.<\/p>": "<p>Yn lluosi'r gwerth presennol â'r gwerth olaf o ffrwd fel y'i dewiswyd o'r rhestr ffrwdiau.<\/p>",
    "\/ feed": "\/ ffrwd",
    "<p>Divides the current value by the last value from a feed as selected from the feed list.<\/p>": "<p>Yn rhannu'r gwerth presennol â'r gwerth olaf o ffrwd fel y'i dewiswyd o'r rhestr ffrwdiau.<\/p>",
    "Reset to ZERO": "Ailosod i SERO",
    "Wh Accumulator": "Crynhowr Wh",
    "Publish to MQTT via Redis": "Cyhoeddi i MQTT trwy Redis",
    "Reset to NULL": "Ailosod i NULL",
    "<p>Value is set to NULL.<\/p><p>Useful for conditional process to work on.<\/p>": "<p>Mae gwerth yn cael ei osod i NULL.<\/p><p>Defnyddiol ar gyfer proses amodol i weithio arni.<\/p>",
    "Reset to Original": "Ailosod i'r Gwreiddiol",
    "<p>The value is set to the original value at the start of the process list.<\/p>": "<p>Mae'r gwerth yn cael ei osod i'r gwerth gwreiddiol ar ddechrau'r rhestr broses.<\/p>",
    "If ZERO, skip next": "Os SERO, sgipio nesaf",
    "Conditional": "Amodol",
    "<p>If value from last process is ZERO, process execution will skip execution of next process in list.<\/p>": "<p>Os yw gwerth o'r broses olaf yn SERO, bydd gweithrediad y broses yn sgipio gweithrediad y broses nesaf yn y rhestr.<\/p>",
    "If !ZERO, skip next": "Os !SERO, sgipio nesaf",
    "<p>If value from last process is NOT ZERO, process execution will skip execution of next process in list.<\/p>": "<p>Os nad yw gwerth o'r broses olaf yn SERO, bydd gweithrediad y broses yn sgipio gweithrediad y broses nesaf yn y rhestr.<\/p>",
    "If NULL, skip next": "Os NULL, sgipio nesaf",
    "<p>If value from last process is NULL, process execution will skip execution of next process in list.<\/p>": "<p>Os yw gwerth o'r broses olaf yn NULL, bydd gweithrediad y broses yn sgipio gweithrediad y broses nesaf yn y rhestr.<\/p>",
    "If !NULL, skip next": "Os !NULL, sgipio nesaf",
    "<p>If value from last process is NOT NULL, process execution will skip execution of next process in list.<\/p>": "<p>Os nad yw gwerth o'r broses olaf yn NULL, bydd gweithrediad y broses yn sgipio gweithrediad y broses nesaf yn y rhestr.<\/p>",
    "If >, skip next": "Os >, sgipio nesaf",
    "Conditional - User value": "Amodol - Gwerth defnyddiwr",
    "<p>If value from last process is greater than the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Os yw gwerth o'r broses olaf yn fwy na'r gwerth penodol, bydd gweithrediad y broses yn sgipio gweithrediad y broses nesaf yn y rhestr.<\/p>",
    "If >=, skip next": "Os >=, sgipio nesaf",
    "<p>If value from last process is greater or equal to the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Os yw gwerth o'r broses olaf yn fwy neu'n hafal i'r gwerth penodol, bydd gweithrediad y broses yn sgipio gweithrediad y broses nesaf yn y rhestr.<\/p>",
    "If <, skip next": "Os <, sgipio nesaf",
    "<p>If value from last process is lower than the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Os yw gwerth o'r broses olaf yn is na'r gwerth penodol, bydd gweithrediad y broses yn sgipio gweithrediad y broses nesaf yn y rhestr.<\/p>",
    "If <=, skip next": "Os <=, sgipio nesaf",
    "<p>If value from last process is lower or equal to the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Os yw gwerth o'r broses olaf yn is neu'n hafal i'r gwerth penodol, bydd gweithrediad y broses yn sgipio gweithrediad y broses nesaf yn y rhestr.<\/p>",
    "If =, skip next": "Os =, sgipio nesaf",
    "<p>If value from last process is equal to the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Os yw gwerth o'r broses olaf yn hafal i'r gwerth penodol, bydd gweithrediad y broses yn sgipio gweithrediad y broses nesaf yn y rhestr.<\/p>",
    "If !=, skip next": "Os !=, sgipio nesaf",
    "<p>If value from last process is NOT equal to the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Os nad yw gwerth o'r broses olaf yn hafal i'r gwerth penodol, bydd gweithrediad y broses yn sgipio gweithrediad y broses nesaf yn y rhestr.<\/p>",
    "GOTO": "EWCH I",
    "Source Feed": "Ffrwd Ffynhonnell",
    "Virtual": "Rithwir",
    "<p><b>Source Feed:<\/b><br>Virtual feeds should use this processor as the first one in the process list. It sources data from the selected feed.<br>The sourced value is passed back for further processing by the next processor in the processing list.<br>You can then add other processors to apply logic on the passed value for post-processing calculations in realtime.<\/p><p>Note: This virtual feed process list is executed on visualizations requests that use this virtual feed.<\/p>": "<p><b>Ffrwd Ffynhonnell:<\/b><br>Dylai ffrwdiau rithwir ddefnyddio'r prosesydd hwn fel yr un cyntaf yn y rhestr broses. Mae'n darparu data o'r ffrwd a ddewiswyd.<br>Mae'r gwerth a ddarparwyd yn cael ei basio'n ôl ar gyfer prosesu pellach gan y prosesydd nesaf yn y rhestr brosesu.<br>Yna gallwch ychwanegu proseswyr eraill i gymhwyso rhesymeg ar y gwerth a basiwyd ar gyfer cyfrifiadau ôl-brosesu mewn amser real.<\/p><p>Nodyn: Mae rhestr broses y ffrwd rithwir hon yn cael ei gweithredu ar geisiadau delweddiadau sy'n defnyddio'r ffrwd rithwir hon.<\/p>",
    "+ source feed": "+ ffrwd ffynhonnell",
    "<p>Add the specified feed.<\/p>": "<p>Ychwanegu'r ffrwd benodol.<\/p>",
    "- source feed": "- ffrwd ffynhonnell",
    "<p>Subtract the specified feed.<\/p>": "<p>Tynnu'r ffrwd benodol.<\/p>",
    "* source feed": "* ffrwd ffynhonnell",
    "<p>Multiply by specified feed.<\/p>": "<p>Lluosi â'r ffrwd benodol.<\/p>",
    "\/ source feed": "\/ ffrwd ffynhonnell",
    "<p>Divide by specified feed. Returns NULL for zero values.<\/p>": "<p>Rhannu â'r ffrwd benodol. Yn dychwelyd NULL ar gyfer gwerthoedd sero.<\/p>",
    "<p>Return the reciprical of the specified feed. Returns NULL for zero values.<\/p>": "<p>Dychwelyd cilyddol y ffrwd benodol. Yn dychwelyd NULL ar gyfer gwerthoedd sero.<\/p>",
    "EXIT": "GADAEL",
    "Hidden": "Cudd",
    "<p>This was automaticaly added when a loop error was discovered on the processList or execution took too many steps to process.  Review the usage of GOTOs or decrease the number of items and delete this entry to resume execution.<\/p>": "<p>Ychwanegwyd hwn yn awtomatig pan ddarganfuwyd gwall dolen ar y rhestr broses neu gymerodd y gweithrediad ormod o gamau i'w brosesu. Adolygwch ddefnydd EWCH I neu leihewch nifer yr eitemau a dilëwch y cofnod hwn i ailgychwyn gweithrediad.<\/p>",
    "Max value allowed": "Gwerth uchaf a ganiateir",
    "<p>If value is greater than <i>max value allowed<\/i> then the value passed to following process will be the <i>max value allowed<\/i><\/p>": "<p>Os yw'r gwerth yn fwy na'r <i>gwerth uchaf a ganiateir<\/i> yna bydd y gwerth a basiwyd i'r broses ganlynol yn <i>gwerth uchaf a ganiateir<\/i><\/p>",
    "Min value allowed": "Gwerth isaf a ganiateir",
    "<p>If value is lower than <i>min value allowed<\/i> then the value passed to following process will be the <i>min value allowed<\/i><\/p>": "<p>Os yw'r gwerth yn is na'r <i>gwerth isaf a ganiateir<\/i> yna bydd y gwerth a basiwyd i'r broses ganlynol yn <i>gwerth isaf a ganiateir<\/i><\/p>",
    "Absolute value": "Gwerth absoliwt",
    "<p>Return the absolute value of the current value. This can be useful for calibrating a particular variable on the web rather than by reprogramming hardware.<\/p>": "<p>Dychwelyd gwerth absoliwt y gwerth presennol. Gall hyn fod yn ddefnyddiol ar gyfer graddnodi newidyn penodol ar y we yn hytrach na thrwy ailraglennu caledwedd.<\/p>",
    "kWh Accumulator": "Crynhowr kWh",
    "Log to feed (Join)": "Cofnodi i ffrwd (Uno)",
    "max by input": "uchaf yn ôl mewnbwn",
    "<p>Limits the current value by the last value from an input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Yn cyfyngu'r gwerth presennol gan y gwerth olaf o fewnbwn fel y'i dewiswyd o'r rhestr mewnbwn. Mae'r canlyniad yn cael ei basio'n ôl ar gyfer prosesu pellach gan y prosesydd nesaf yn y rhestr brosesu.<\/p>",
    "min by input": "isaf yn ôl mewnbwn",
    "max by feed": "uchaf yn ôl ffrwd",
    "<p>Limits the current value by the last value from an feed as selected from the feed list. The result is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Yn cyfyngu'r gwerth presennol gan y gwerth olaf o ffrwd fel y'i dewiswyd o'r rhestr ffrwdiau. Mae'r canlyniad yn cael ei basio'n ôl ar gyfer prosesu pellach gan y prosesydd nesaf yn y rhestr brosesu.<\/p>",
    "min by feed": "isaf yn ôl ffrwd",
    "Power to kWh\/15min": "Pŵer i kWh\/15mun",
    "<p>Convert a power value in Watts to a feed that contains an entry for the total energy used every 15 min (starting mid night) (kWh\/15min)<\/p>": "<p>Trosi gwerth pŵer mewn Watiau i ffrwd sy'n cynnwys cofnod ar gyfer cyfanswm yr ynni a ddefnyddiwyd bob 15 munud (yn dechrau canol nos) (kWh\/15mun)<\/p>",
    "Power to kWh \/ custom minutes": "Pŵer i kWh \/ munudau arferedig",
    "Slot in minutes slot to accumulate": "Slot mewn munudau slot i gronni",
    "Output feed": "Ffrwd allbwn",
    "<p>Convert a power value in Watts to a feed that contains an entry for the total energy used every selected minutes (starting mid night) (kWh\/x min)<\/p>": "<p>Trosi gwerth pŵer mewn Watiau i ffrwd sy'n cynnwys cofnod ar gyfer cyfanswm yr ynni a ddefnyddiwyd bob munud a ddewiswyd (yn dechrau canol nos) (kWh\/x mun)<\/p>",
    "Process list must be an array": "Rhaid i'r rhestr broses fod yn arae",
    "Missing process key in process list at index $index": "Allwedd broses ar goll yn rhestr y broses ar fynegai $index",
    "Invalid or missing args in process list at index $index": "Dadleuon annilys neu ar goll yn rhestr y broses ar fynegai $index",
    "Invalid process process key:$process_key": "Allwedd proses broses annilys:$process_key",
    "Invalid number of arguments for process: $processkey": "Nifer annilys o ddadleuon ar gyfer proses: $processkey",
    "Invalid feed": "Ffrwd annilys",
    "Invalid input": "Mewnbwn annilys",
    "Cut": "Torri",
    "Copy": "Copïo",
    "Paste": "Gludo",
    "Delete": "Dileu",
    "process list setup": "gosodiad rhestr broses",
    "Processes are executed sequentially with the result value being passed down for further processing to the next processor on this processing list.": "Mae prosesau yn cael eu gweithredu yn ddilyniannol gyda'r gwerth canlyniad yn cael ei basio i lawr ar gyfer prosesu pellach i'r prosesydd nesaf ar y rhestr brosesu hon.",
    "You have no processes defined": "Nid oes gennych brosesau wedi'u diffinio",
    "Order": "Trefn",
    "Process": "Proses",
    "Hover over the short names below to get the full description": "Hofran dros yr enwau byr isod i gael y disgrifiad llawn",
    "Arguments": "Dadleuon",
    "Latest": "Diweddaraf",
    "Actions": "Gweithredoedd",
    "Add process": "Ychwanegu proses",
    "Edit process": "Golygu proses",
    "Type value...": "Teipiwch werth...",
    "Type text...": "Teipiwch destun...",
    "Schedule": "Amserlen",
    "Please enter a feed tag consisting of alphabetical letters, A-Z a-z 0-9 - _ : and spaces": "Rhowch tag ffrwd sy'n cynnwys llythrennau'r wyddor, A-Z a-z 0-9 - _ : a bylchau",
    "Tag": "Tag",
    "Please enter a feed name consisting of alphabetical letters, A-Z a-z 0-9 - _ : and spaces": "Rhowch enw ffrwd sy'n cynnwys llythrennau'r wyddor, A-Z a-z 0-9 - _ : a bylchau",
    "Name": "Enw",
    "Engine": "Peiriant",
    "Select interval": "Dewis cyfnod",
    "Please enter a table name consisting of alphabetical letters, A-Z a-z 0-9 and _ characters": "Rhowch enw tabl sy'n cynnwys llythrennau'r wyddor, A-Z a-z 0-9 a nodau _",
    "Table": "Tabl",
    "Add": "Ychwanegu",
    "Edit": "Golygu",
    "Cancel": "Canslo",
    "Click here for additional information about this process": "Cliciwch yma am wybodaeth ychwanegol am y broses hon",
    "Output:": "Allbwn:",
    "Does NOT modify value passed onto next process step.": "NID yw'n addasu'r gwerth a basiwyd i'r cam proses nesaf.",
    "Modified value passed onto next process step.": "Gwerth wedi'i addasu a basiwyd i'r cam proses nesaf.",
    "REDIS:": "REDIS:",
    "Requires REDIS.": "Angen REDIS.",
    "Close": "Cau",
    "Not modified": "Heb ei addasu",
    "Changed, press to save": "Wedi newid, pwyswch i gadw",
    "Saved": "Wedi cadw",
    "Process API": "API Proses",
    "Apikey authentication": "Dilysu allwedd API",
    "If you want to call any of the following actions when your not logged in you have this options to authenticate with the API key:": "Os ydych eisiau galw unrhyw un o'r gweithredoedd canlynol pan nad ydych wedi mewngofnodi mae gennych yr opsiynau hyn i ddilysu â'r allwedd API:",
    "Append on the URL of your request: &apikey=APIKEY": "Ychwanegu at URL eich cais: &apikey=APIKEY",
    "Read only:": "Darllen yn unig:",
    "Read & Write:": "Darllen ac Ysgrifennu:",
    "Available HTML URLs": "URLau HTML sydd ar gael",
    "This page": "Y dudalen hon",
    "Available JSON commands": "Gorchmynion JSON sydd ar gael",
    "To use the json api the request url needs to include <b>.json<\/b>": "I ddefnyddio'r api json mae angen i url y cais gynnwys <b>.json<\/b>",
    "Process actions": "Gweithredoedd proses",
    "List all supported process": "Rhestru'r holl brosesau a gefnogir",
    "<p>Convert a power value in Watts to a cumulative kWh feed.<br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1. See <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "<p>Trosi gwerth pŵer mewn Watiau i ffrwd kWh grynoadol.<br><br><b>Awgrym delweddiad:<\/b> Gellir defnyddio ffrwdiau a grëwyd â'r prosesydd mewnbwn hwn i gynhyrchu data kWh dyddiol gan ddefnyddio'r delweddiad BarGraph gyda'r eiddo delta wedi'i osod i 1. Gweler <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Canllaw: kWh Dyddiol<\/a><br><br>",
    "<p>The value \"0\" is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Mae'r gwerth \"0\" yn cael ei basio'n ôl ar gyfer prosesu pellach gan y prosesydd nesaf yn y rhestr brosesu.<\/p>",
    "Use with emontx, emonth or emonpi pulsecount or an emontx running firmware <i>emonTxV3_4_continuous_kwhtotals<i> sending cumulative watt hours.<br><br>This processor ensures that when the emontx is reset the watt hour count in emoncms does not reset, it also checks filter's out spikes in energy use that are larger than a max power threshold set in the processor, assuming these are error's, the max power threshold is set to 60 kW. <br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1 and scale set to 0.001. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "Defnyddiwch gyda chyfrif curiad emontx, emonth neu emonpi neu emontx sy'n rhedeg firmware <i>emonTxV3_4_continuous_kwhtotals<\/i> sy'n anfon oriau wat crynoadol.<br><br>Mae'r prosesydd hwn yn sicrhau pan gaiff yr emontx ei ailosod nad yw'r cyfrif oriau wat yn emoncms yn ailosod, mae hefyd yn gwirio ac yn hidlo pigau mewn defnydd ynni sy'n fwy na throthwy pŵer uchaf a osodwyd yn y prosesydd, gan dybio bod y rhain yn wallau, mae'r trothwy pŵer uchaf wedi'i osod i 60 kW. <br><br><b>Awgrym delweddiad:<\/b> Gellir defnyddio ffrwdiau a grëwyd â'r prosesydd mewnbwn hwn i gynhyrchu data kWh dyddiol gan ddefnyddio'r delweddiad BarGraph gyda'r eiddo delta wedi'i osod i 1 a'r raddfa wedi'i osod i 0.001. Gweler: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Canllaw: kWh Dyddiol<\/a><br><br>",
    "<p>Publishes value to REDIS for phpmqtt_input.php to publish the values to MQTT topic e.g. 'home\/power\/kitchen'<\/p>": "<p>Yn cyhoeddi gwerth i REDIS ar gyfer phpmqtt_input.php i gyhoeddi'r gwerthoedd i bwnc MQTT e.e. 'cartref\/pŵer\/cegin'<\/p>",
    "<p>Jumps the process execution to the specified position.<\/p><p><b>Warning<\/b><br>If you're not careful you can create a goto loop on the process list.<br>When a loop occurs, the API will appear to lock until the server php times out with an error.<\/p>": "<p>Yn neidio gweithrediad y broses i'r safle penodol.<\/p><p><b>Rhybudd<\/b><br>Os nad ydych yn ofalus gallwch greu dolen goto ar y rhestr broses.<br>Pan mae dolen yn digwydd, bydd yr API yn ymddangos i gloi hyd nes bod php y gweinydd yn dod i ben gyda gwall.<\/p>",
    "This processor removes resets from a cumulative kWh input, it also filter's out spikes in energy use that are larger than a max power threshold set in the processor, assuming these are error's, the max power threshold is set to 60 kW. <br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1 and scale set to 0.001. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "Mae'r prosesydd hwn yn tynnu ailosodiadau o fewnbwn kWh crynoadol, mae hefyd yn hidlo pigau mewn defnydd ynni sy'n fwy na throthwy pŵer uchaf a osodwyd yn y prosesydd, gan dybio bod y rhain yn wallau, mae'r trothwy pŵer uchaf wedi'i osod i 60 kW. <br><br><b>Awgrym delweddiad:<\/b> Gellir defnyddio ffrwdiau a grëwyd â'r prosesydd mewnbwn hwn i gynhyrchu data kWh dyddiol gan ddefnyddio'r delweddiad BarGraph gyda'r eiddo delta wedi'i osod i 1 a'r raddfa wedi'i osod i 0.001. Gweler: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Canllaw: kWh Dyddiol<\/a><br><br>",
    "<p>In addition to the standard log to feed process, this process links missing data points with a straight line between the newest value and the previous value. It is designed for use with total cumulative kWh meter reading inputs, producing a feed that can be used with the delta property when creating bar graphs. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "<p>Yn ogystal â'r broses cofnodi i ffrwd safonol, mae'r broses hon yn cysylltu pwyntiau data coll â llinell syth rhwng y gwerth diweddaraf a'r gwerth blaenorol. Mae wedi'i gynllunio i'w ddefnyddio gyda mewnbynnau darlleniad mesurydd kWh crynoadol cyfan, gan gynhyrchu ffrwd y gellir ei defnyddio â'r eiddo delta wrth greu graffiau bar. Gweler: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Canllaw: kWh Dyddiol<\/a><br><br>",
    "Invalid process list format: ": "Fformat rhestr broses annilys: ",
    "Use POST parameter: \"apikey=APIKEY\"": "Defnyddio paramedr POST: \"apikey=APIKEY\"",
    "Add the HTTP header: \"Authorization: Bearer APIKEY\"": "Ychwanegu'r pennyn HTTP: \"Authorization: Bearer APIKEY\""
}