{
    "Process API": "API traitement",
    "Apikey authentication": "Authentification clé API",
    "If you want to call any of the following actions when your not logged in you have this options to authenticate with the API key:": "Si vous souhaitez appeler une des actions suivantes alors que vous n'êtes pas connecté, vous pouvez vous authentifier avec votre clé API :",
    "Append on the URL of your request: &apikey=APIKEY": "Veuillez ajouter votre clé d'API à la fin de l'url : &apikey=APIKEY",
    "Use POST parameter: \"apikey=APIKEY\"": "Utilisez le paramètre POST \"apikey=APIKEY\"",
    "Add the HTTP header: \"Authorization: Bearer APIKEY\"": "Ajoutez l'en-tête HTTP : \"Authorization: Bearer APIKEY\"",
    "Read only:": "Lecture uniquement : ",
    "Read & Write:": "Lecture & Écriture : ",
    "Available HTML URLs": "URLs HTML disponibles",
    "This page": "Cette page",
    "Available JSON commands": "Commandes JSON disponibles",
    "To use the json api the request url needs to include <b>.json<\/b>": "Si vous souhaitez utiliser l'API json, veuillez ajouter <b>.json<\/b> à la fin de l'url",
    "Process actions": "Actions de traitement",
    "List all supported process": "Lister tous les traitements supportés",
    "process list setup": "paramétrage liste des traitements",
    "Processes are executed sequentially with the result value being passed down for further processing to the next processor on this processing list.": "Les processus sont exécutés séquentiellement avec la valeur de résultat transmise pour traitement ultérieur au processus suivant sur cette liste de traitement.",
    "You have no processes defined": "Vous n'avez aucun traitement défini",
    "Order": "Ordre",
    "Process": "Traitement",
    "Latest": "Dernière valeur",
    "Actions": "Actions",
    "Add process": "Ajouter un traitement",
    "Edit process": "Modifier un traitement",
    "Type value...": "Saisir valeur...",
    "Type text...": "Saisir texte...",
    "Input": "Source",
    "Schedule": "Planification",
    "Feed": "Flux",
    "Please enter a feed tag consisting of alphabetical letters, A-Z a-z 0-9 - _ : and spaces": "Veuillez saisir une étiquette de flux composée de lettres alphabétiques, A-Z a-z 0-9 - _ : et espaces",
    "Tag": "Étiquette",
    "Please enter a feed name consisting of alphabetical letters, A-Z a-z 0-9 - _ : and spaces": "Veuillez saisir un nom de flux composé de lettres alphabétiques, A-Z a-z 0-9 - _ : et espaces",
    "Name": "Nom",
    "Engine": "Moteur",
    "Select interval": "Sélectionner intervalle",
    "Please enter a table name consisting of alphabetical letters, A-Z a-z 0-9 and _ characters": "Veuillez saisir un nom de table composé de lettres alphabétiques, A-Z a-z 0-9 - _ : et espaces",
    "Table": "Table",
    "Add": "Ajouter",
    "Edit": "Modifier",
    "Cancel": "Annuler",
    "Close": "Fermer",
    "Not modified": "Non modifié",
    "Changed, press to save": "Modifié, presser pour sauver",
    "Delete": "Supprimer",
    "Does NOT modify value passed onto next process step.": "Ne modifie PAS la valeur transmise à l'étape de traitement suivante.",
    "Modified value passed onto next process step.": "La valeur modifiée est transmise à l'étape de traitement suivante.",
    "Requires REDIS.": "Requiert REDIS.",
    "Saved": "Sauvegardé",
    "Log to feed": "Log to feed",
    "Main": "Principal",
    "x": "x",
    "Calibration": "Calibrage",
    "<p>Multiplies current value by given constant. This can be useful for calibrating a particular variable on the web rather than by reprogramming hardware.<\/p>": "<p>Multiplie la valeur actuelle par la constante donnée. Cela peut être utile pour étalonner une variable particulière sur le web plutôt qu'une reprogrammation matérielle.<\/p>",
    "+": "+",
    "<p>Offset current value by given value. This can again be useful for calibrating a particular variable on the web rather than by reprogramming hardware.<\/p>": "<p>Décale la valeur actuelle d'une valeur donnée. Cela peut encore être utile pour calibrer une variable particulière sur le web plutôt qu'une reprogrammation matérielle.<\/p>",
    "Power to kWh": "Power to kWh",
    "Power to kWh\/d": "Power to kWh\/d",
    "Power & Energy": "Puissance & Énergie",
    "<p>Convert a power value in Watts to a feed that contains an entry for the total energy used each day (kWh\/d)<\/p>": "<p>Convertit une valeur de puissance en watts en un flux contenant une entrée pour l'énergie totale utilisée chaque jour (kWh\/j)<\/p>",
    "x input": "x input",
    "<p>Multiplies the current value with the last value from other input as selected from the input list.<\/p>": "<p>Multiplie la valeur actuelle par la dernière valeur d'une autre entrée sélectionnée dans la liste d'entrée.<\/p>",
    "Input on-time": "Input on-time",
    "<p>Counts the amount of time that an input is high in each day and logs the result to a feed. Created for counting the number of hours a solar hot water pump is on each day<\/p>": "<p>Compte la quantité de temps qu'une entrée est élevée chaque jour et enregistre le résultat dans un flux. Créé pour compter le nombre d'heures d'une pompe à eau chaude solaire chaque jour<\/p>",
    "Wh increments to kWh\/d": "Wh increments to kWh\/d",
    "<p>Accumulate Wh measurements into kWh\/d.<p><b>Input<\/b>: energy increments in Wh.<\/p>": "<p>Accumule les mesures de Wh en kWh\/j.<p><b>Input<\/b>: incréments d'énergie en Wh.<\/p>",
    "kWh to kWh\/d (OLD)": "kWh to kWh\/d (OLD)",
    "Deleted": "Supprimé",
    "Update feed at day": "Update feed at day",
    "<p>Updates or inserts daily value on the specified time (given by the JSON time parameter from the API) of the specified feed<\/p>": "<p>Met à jour ou insère la valeur quotidienne au temps spécifié (donné par le paramètre de temps JSON de l'API) du flux spécifié<\/p>",
    "+ input": "+ input",
    "<p>Adds the current value with the last value from other input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Ajoute la valeur actuelle à la dernière valeur de l'autre entrée sélectionnée dans la liste d'entrée. Le résultat est renvoyé pour traitement ultérieur par le traitement suivant dans la liste de traitement.<\/p>",
    "\/ input": "\/ input",
    "<p>Divides the current value with the last value from other input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Divise la valeur actuelle à la dernière valeur de l'autre entrée sélectionnée dans la liste d'entrée. Le résultat est renvoyé pour traitement ultérieur par le traitement suivant dans la liste de traitement.<\/p>",
    "Phaseshift": "Phaseshift",
    "Accumulator": "Accumulator",
    "Misc": "Divers",
    "<p>Output feed accumulates by input value<\/p>": "<p>Le flux de sortie s'accumule en fonction de la valeur d'entrée<\/p>",
    "Rate of change": "Rate of change",
    "<p>Output feed is the difference between the current value and the last<\/p>": "<p>Le flux de sortie est la différence entre la valeur actuelle et la dernière valeur<\/p>",
    "Histogram": "Histogram",
    "Daily Average": "Daily Average",
    "Heat flux": "Heat flux",
    "Power gained to kWh\/d": "Power gained to kWh\/d",
    "Total pulse count to pulse increment": "Total pulse count to pulse increment",
    "Pulse": "Impulsion",
    "<p>Returns the number of pulses incremented since the last update for a input that is a cumulative pulse count. i.e If the input updates from 23400 to 23410 the result will be an incremenet of 10.<\/p>": "<p>Renvoie le nombre d'incréments d'impulsions depuis la dernière mise à jour pour une entrée qui est un nombre d'impulsions cumulatif. Par exemple, si l'entrée est mise à jour de 23400 à 23410, le résultat sera un incrément de 10.<\/p>",
    "kWh to Power": "kWh to Power",
    "<p>Convert accumulating kWh to instantaneous power<\/p>": "<p>Convertit les kWh accumulés en puissance instantanée<\/p>",
    "- input": "- input",
    "<p>Subtracts from the current value the last value from other input as selected from the input list.<\/p>": "<p>Soustrait de la valeur actuelle la dernière valeur de l'autre entrée sélectionnée dans la liste d'entrée.<\/p>",
    "kWh to kWh\/d": "kWh to kWh\/d",
    "<p>Upsert kWh to a daily value.<\/p>": "<p>Ajoute ou met à jour des kWh à la valeur quotidienne.<\/p>",
    "Allow positive": "Allow positive",
    "Limits": "Limites",
    "<p>Negative values are zeroed for further processing by the next processor in the processing list.<\/p>": "<p>Les valeurs négatives sont mises à zéro pour traitement ultérieur par le traitement suivant dans la liste de traitement.<\/p>",
    "Allow negative": "Allow negative",
    "<p>Positive values are zeroed for further processing by the next processor in the processing list.<\/p>": "<p>Les valeurs positives sont mises à zéro pour traitement ultérieur par le traitement suivant dans la liste de traitement.<\/p>",
    "Signed to unsigned": "Signed to unsigned",
    "<p>Convert a number that was interpreted as a 16 bit signed number to an unsigned number.<\/p>": "<p>Convertit un nombre qui a été interprété comme un nombre signé de 16 bits à un nombre non signé.<\/p>",
    "Max daily value": "Max daily value",
    "<p>Maximal daily value. Upserts on the selected daily feed the highest value reached each day.<\/p>": "<p>Valeur quotidienne maximale. Ajoute ou met à jour sur le flux quotidien sélectionné la valeur la plus élevée atteinte chaque jour.<\/p>",
    "Min daily value": "Min daily value",
    "<p>Minimal daily value. Upserts on the selected daily feed the lowest value reached each day.<\/p>": "<p>Valeur quotidienne minimale. Ajoute ou met à jour sur le flux quotidien sélectionné la valeur la plus élevée atteinte chaque jour<\/p>",
    "+ feed": "+ feed",
    "<p>Adds the current value with the last value from a feed as selected from the feed list.<\/p>": "<p>Ajoute la valeur actuelle à la dernière valeur d'un flux sélectionnée dans la liste des flux.<\/p>",
    "- feed": "- feed",
    "<p>Subtracts from the current value the last value from a feed as selected from the feed list.<\/p>": "<p>Soustrait de la valeur actuelle la dernière valeur d'un flux sélectionné dans la liste des flux.<\/p>",
    "* feed": "* feed",
    "<p>Multiplies the current value with the last value from a feed as selected from the feed list.<\/p>": "<p>Multiplie la valeur actuelle la dernière valeur d'un flux sélectionné dans la liste des flux.<\/p>",
    "\/ feed": "\/ feed",
    "<p>Divides the current value by the last value from a feed as selected from the feed list.<\/p>": "<p>Divise la valeur actuelle la dernière valeur d'un flux sélectionné dans la liste des flux.<\/p>",
    "Reset to ZERO": "Reset to ZERO",
    "<p>The value \"0\" is passed back for further processing by the next processor in the processing list.<\/p>": "<p>La valeur \"0\" est renvoyée pour traitement ultérieur par le processeur suivant dans la liste de traitement.<\/p>",
    "Wh Accumulator": "Wh Accumulator",
    "Reset to NULL": "Reset to NULL",
    "<p>Value is set to NULL.<\/p><p>Useful for conditional process to work on.<\/p>": "<p>La valeur est définie à NULL.<\/p><p>Utile pour un travail sur processus conditionnel.<\/p>",
    "Reset to Original": "Reset to Original",
    "<p>The value is set to the original value at the start of the process list.<\/p>": "<p>La valeur est définie sur la valeur d'origine au début de la liste de processus.<\/p>",
    "If ZERO, skip next": "If ZERO, skip next",
    "Conditional": "Conditionnel",
    "<p>If value from last process is ZERO, process execution will skip execution of next process in list.<\/p>": "<p>Si la valeur du dernier processus est ZERO, l'exécution du processus ignorera l'exécution du processus suivant dans la liste.<\/p>",
    "If !ZERO, skip next": "If !ZERO, skip next",
    "<p>If value from last process is NOT ZERO, process execution will skip execution of next process in list.<\/p>": "<p>Si la valeur du dernier processus est NOT ZERO, l'exécution du processus ignorera l'exécution du processus suivant dans la liste.<\/p>",
    "If NULL, skip next": "If NULL, skip next",
    "<p>If value from last process is NULL, process execution will skip execution of next process in list.<\/p>": "<p>Si la valeur du dernier processus est NULL, l'exécution du processus ignorera l'exécution du processus suivant dans la liste.<\/p>",
    "If !NULL, skip next": "If !NULL, skip next",
    "<p>If value from last process is NOT NULL, process execution will skip execution of next process in list.<\/p>": "<p>Si la valeur du dernier processus est NOT NULL, l'exécution du processus ignorera l'exécution du processus suivant dans la liste.<\/p>",
    "If >, skip next": "If >, skip next",
    "Conditional - User value": "Conditionnel - Valeur utilisateur",
    "<p>If value from last process is greater than the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Si la valeur du dernier processus est supérieure à la valeur spécifiée, l'exécution du processus ignorera l'exécution du processus suivant dans la liste.<\/p>",
    "If >=, skip next": "If >=, skip next",
    "<p>If value from last process is greater or equal to the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Si la valeur du dernier processus est supérieure ou égale à la valeur spécifiée, l'exécution du processus ignorera l'exécution du processus suivant dans la liste.<\/p>",
    "If <, skip next": "If <, skip next",
    "<p>If value from last process is lower than the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Si la valeur du dernier processus est inferieure à la valeur spécifiée, l'exécution du processus ignorera l'exécution du processus suivant dans la liste.<\/p>",
    "If <=, skip next": "If <=, skip next",
    "<p>If value from last process is lower or equal to the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Si la valeur du dernier processus est inferieure ou égale à la valeur spécifiée, l'exécution du processus ignorera l'exécution du processus suivant dans la liste.<\/p>",
    "If =, skip next": "If =, skip next",
    "<p>If value from last process is equal to the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Si la valeur du dernier processus est égale à la valeur spécifiée, l'exécution du processus ignorera l'exécution du processus suivant dans la liste.<\/p>",
    "If !=, skip next": "If !=, skip next",
    "<p>If value from last process is NOT equal to the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Si la valeur du dernier processus n'est PAS égale à la valeur spécifiée, l'exécution du processus ignorera l'exécution du processus suivant dans la liste.<\/p>",
    "GOTO": "GOTO",
    "<p>Jumps the process execution to the specified position.<\/p><p><b>Warning<\/b><br>If you're not careful you can create a goto loop on the process list.<br>When a loop occurs, the API will appear to lock until the server php times out with an error.<\/p>": "<p>Passe l'exécution du processus à la position spécifiée.<\/p><p><b>Avertissement<\/b><br>Si vous ne faites pas attention, vous pouvez créer une boucle goto dans la liste des processus.<br>Lorsqu'une boucle se produit, l'API semble se verrouiller jusqu'à ce que le serveur php expire avec une erreur.<\/p>",
    "Source Feed": "Source Feed",
    "Virtual": "Virtuel",
    "<p><b>Source Feed:<\/b><br>Virtual feeds should use this processor as the first one in the process list. It sources data from the selected feed.<br>The sourced value is passed back for further processing by the next processor in the processing list.<br>You can then add other processors to apply logic on the passed value for post-processing calculations in realtime.<\/p><p>Note: This virtual feed process list is executed on visualizations requests that use this virtual feed.<\/p>": "<p><b>Source Feed:<\/b><br>Les flux virtuels doivent utiliser ce traitement en tant que premier dans la liste des processus. Il extrait les données du flux sélectionné.<br>La valeur de la source est renvoyée pour un traitement ultérieur par le processeur suivant dans la liste de traitement.<br>Vous pouvez ensuite ajouter d'autres traitements pour appliquer la logique sur la valeur transmise pour les calculs de post-traitement en temps réel.<\/p><p>Remarque : Cette liste de processus de flux virtuel est exécutée sur les demandes de visualisations qui utilisent ce flux virtuel.<\/p>",
    "+ source feed": "+ source feed",
    "<p>Add the specified feed.<\/p>": "<p>Ajoute le flux spécifié.<\/p>",
    "- source feed": "- source feed",
    "<p>Subtract the specified feed.<\/p>": "<p>Soustrait le flux spécifié.<\/p>",
    "* source feed": "* source feed",
    "<p>Multiply by specified feed.<\/p>": "<p>Multiplie par le flux spécifié.<\/p>",
    "\/ source feed": "\/ source feed",
    "<p>Divide by specified feed. Returns NULL for zero values.<\/p>": "<p>Divise par le flux spécifié. Retourne NULL pur les valeurs zéro.<\/p>",
    "<p>Return the reciprical of the specified feed. Returns NULL for zero values.<\/p>": "<p>Renvoie l'inverse du flux spécifié. Renvoie la valeur NULL pour les valeurs nulles.<\/p>",
    "EXIT": "EXIT",
    "Hidden": "Masqué",
    "<p>This was automaticaly added when a loop error was discovered on the processList or execution took too many steps to process.  Review the usage of GOTOs or decrease the number of items and delete this entry to resume execution.<\/p>": "<p>Cela a été automatiquement ajouté lorsqu'une erreur de boucle a été découverte dans la liste des traitements ou que l'exécution a pris trop d'étapes à traiter. Vérifiez l'utilisation des GOTO ou réduisez le nombre d'éléments et supprimez cette entrée pour reprendre l'exécution.<\/p>",
    "Max value allowed": "Valeur maximale autorisée",
    "<p>If value is greater than <i>max value allowed<\/i> then the value passed to following process will be the <i>max value allowed<\/i><\/p>": "<p>Si la valeur est supérieure à <i>max value allowed<\/i> alors la valeur passée au traitement suivant est <i>max value allowed<\/i><\/p>",
    "Min value allowed": "Valeur minimale autorisée",
    "<p>If value is lower than <i>min value allowed<\/i> then the value passed to following process will be the <i>min value allowed<\/i><\/p>": "<p>Si la valeur est inférieure à <i>min value allowed<\/i> alors la valeur passée au traitement suivant est <i>min value allowed<\/i><\/p>",
    "Absolute value": "Valeur absolue",
    "<p>Return the absolute value of the current value. This can be useful for calibrating a particular variable on the web rather than by reprogramming hardware.<\/p>": "<p>Retourne la valeur absolue de la valeur actuelle. Cela peut être utile pour calibrer une variable particulière sur le web plutôt que par reprogrammation matérielle.<\/p>",
    "kWh Accumulator": "Accumulateur kWh",
    "Log to feed (Join)": "Enregistrer dans le flux (Join)",
    "max by input": "max par entrée",
    "<p>Limits the current value by the last value from an input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Limite la valeur actuelle par la dernière valeur d'une entrée sélectionnée dans la liste d'entrée. Le résultat est renvoyé pour traitement ultérieur par le processeur suivant dans la liste de traitement.<\/p>",
    "min by input": "min par entrée",
    "max by feed": "max par flux",
    "<p>Limits the current value by the last value from an feed as selected from the feed list. The result is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Limite la valeur actuelle par la dernière valeur d'un flux sélectionné dans la liste des flux. Le résultat est renvoyé pour traitement ultérieur par le processeur suivant dans la liste de traitement.<\/p>",
    "min by feed": "min par flux",
    "<p>This processor logs to a timeseries feed which can then be used to explore historic data. This is recommended for logging power, temperature, humidity, voltage and current data.<\/p><p><b>Feed engine:<\/b><ul><li><b>Emoncms Fixed Interval TimeSeries (PHPFina)<\/b> is the recommended feed engine, it is a fixed interval timeseries engine.<\/li><li><b>Emoncms Variable Interval TimeSeries (PHPTimeseries)<\/b> is for data posted at a non regular interval.<\/li><\/ul><\/p><p><b>Feed interval:<\/b> When selecting the feed interval select an interval that is the same as, or longer than the update rate that is set in your monitoring equipment. Setting the interval rate to be shorter than the update rate of the equipment causes un-needed disk space to be used up.<\/p>": "<p>Ce processeur enregistre dans un flux de séries temporelles qui peut ensuite être utilisé pour explorer les données historiques. Ceci est recommandé pour enregistrer les données de puissance, température, humidité, tension et courant.<\/p><p><b>Moteur de flux :<\/b><ul><li><b>Emoncms Fixed Interval TimeSeries (PHPFina)<\/b> est le moteur de flux recommandé, c'est un moteur de séries temporelles à intervalle fixe.<\/li><li><b>Emoncms Variable Interval TimeSeries (PHPTimeseries)<\/b> est pour les données publiées à intervalle non régulier.<\/li><\/ul><\/p><p><b>Intervalle de flux :<\/b> Lors de la sélection de l'intervalle de flux, sélectionnez un intervalle identique ou supérieur au taux de mise à jour défini dans votre équipement de surveillance. Définir un taux d'intervalle plus court que le taux de mise à jour de l'équipement entraîne une utilisation inutile de l'espace disque.<\/p>",
    "<p>Convert a power value in Watts to a cumulative kWh feed.<br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1. See <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "<p>Convertit une valeur de puissance en watts en flux kWh cumulatif.<br><br><b>Conseil de visualisation :<\/b> Les flux créés avec ce processeur d'entrée peuvent être utilisés pour générer des données kWh quotidiennes en utilisant la visualisation BarGraph avec la propriété delta définie à 1. Voir <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: kWh quotidien<\/a><br><br>",
    "Use with emontx, emonth or emonpi pulsecount or an emontx running firmware <i>emonTxV3_4_continuous_kwhtotals<\/i> sending cumulative watt hours.<br><br>This processor ensures that when the emontx is reset the watt hour count in emoncms does not reset, it also checks filter's out spikes in energy use that are larger than a max power threshold set in the processor, assuming these are error's, the max power threshold is set to 60 kW. <br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1 and scale set to 0.001. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "À utiliser avec emontx, emonth ou emonpi pulsecount ou un emontx exécutant le firmware <i>emonTxV3_4_continuous_kwhtotals<\/i> envoyant des watt-heures cumulatives.<br><br>Ce processeur garantit que lorsque l'emontx est réinitialisé, le décompte de watt-heures dans emoncms n'est pas réinitialisé, il vérifie également et filtre les pics d'utilisation d'énergie supérieurs à un seuil de puissance maximale défini dans le processeur, en supposant qu'il s'agit d'erreurs, le seuil de puissance maximale est fixé à 60 kW. <br><br><b>Conseil de visualisation :<\/b> Les flux créés avec ce processeur d'entrée peuvent être utilisés pour générer des données kWh quotidiennes en utilisant la visualisation BarGraph avec la propriété delta définie à 1 et l'échelle définie à 0.001. Voir : <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: kWh quotidien<\/a><br><br>",
    "Publish to MQTT via Redis": "Publier vers MQTT via Redis",
    "<p>Publishes value to REDIS for phpmqtt_input.php to publish the values to MQTT topic e.g. 'home\/power\/kitchen'<\/p>": "<p>Publie la valeur vers REDIS pour que phpmqtt_input.php publie les valeurs vers le sujet MQTT par ex. 'home\/power\/kitchen'<\/p>",
    "This processor removes resets from a cumulative kWh input, it also filter's out spikes in energy use that are larger than a max power threshold set in the processor, assuming these are error's, the max power threshold is set to 60 kW. <br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1 and scale set to 0.001. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "Ce processeur supprime les réinitialisations d'une entrée kWh cumulative, il filtre également les pics d'utilisation d'énergie supérieurs à un seuil de puissance maximale défini dans le processeur, en supposant qu'il s'agit d'erreurs, le seuil de puissance maximale est fixé à 60 kW. <br><br><b>Conseil de visualisation :<\/b> Les flux créés avec ce processeur d'entrée peuvent être utilisés pour générer des données kWh quotidiennes en utilisant la visualisation BarGraph avec la propriété delta définie à 1 et l'échelle définie à 0.001. Voir : <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: kWh quotidien<\/a><br><br>",
    "<p>In addition to the standard log to feed process, this process links missing data points with a straight line between the newest value and the previous value. It is designed for use with total cumulative kWh meter reading inputs, producing a feed that can be used with the delta property when creating bar graphs. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "<p>En plus du processus standard d'enregistrement vers le flux, ce processus relie les points de données manquants avec une ligne droite entre la valeur la plus récente et la valeur précédente. Il est conçu pour être utilisé avec les entrées de lecture de compteur kWh cumulatives totales, produisant un flux qui peut être utilisé avec la propriété delta lors de la création de graphiques en barres. Voir : <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: kWh quotidien<\/a><br><br>",
    "Power to kWh\/15min": "Puissance vers kWh\/15min",
    "<p>Convert a power value in Watts to a feed that contains an entry for the total energy used every 15 min (starting mid night) (kWh\/15min)<\/p>": "<p>Convertit une valeur de puissance en watts en un flux contenant une entrée pour l'énergie totale utilisée toutes les 15 min (en commençant à minuit) (kWh\/15min)<\/p>",
    "Power to kWh \/ custom minutes": "Puissance vers kWh \/ minutes personnalisées",
    "Slot in minutes slot to accumulate": "Créneau en minutes pour accumuler",
    "Output feed": "Flux de sortie",
    "<p>Convert a power value in Watts to a feed that contains an entry for the total energy used every selected minutes (starting mid night) (kWh\/x min)<\/p>": "<p>Convertit une valeur de puissance en watts en un flux contenant une entrée pour l'énergie totale utilisée toutes les minutes sélectionnées (en commençant à minuit) (kWh\/x min)<\/p>",
    "Invalid process list format: ": "Format de liste de processus invalide : ",
    "Process list must be an array": "La liste des processus doit être un tableau",
    "Missing process key in process list at index $index": "Clé de processus manquante dans la liste des processus à l'index $index",
    "Invalid or missing args in process list at index $index": "Arguments invalides ou manquants dans la liste des processus à l'index $index",
    "Invalid process process key:$process_key": "Clé de processus invalide : $process_key",
    "Invalid number of arguments for process: $processkey": "Nombre d'arguments invalide pour le processus : $processkey",
    "Invalid feed": "Flux invalide",
    "Invalid input": "Entrée invalide",
    "Cut": "Couper",
    "Copy": "Copier",
    "Paste": "Coller",
    "Hover over the short names below to get the full description": "Survolez les noms courts ci-dessous pour obtenir la description complète",
    "Arguments": "Arguments",
    "Click here for additional information about this process": "Cliquez ici pour des informations supplémentaires sur ce processus",
    "Output:": "Sortie :",
    "REDIS:": "REDIS :"
}