{
    "Value": "Valore",
    "Text": "Testo",
    "Type feed tag...": "Digitare il tag feed...",
    "Type feed name...": "Nome feed tipo...",
    "Click here for additional information about this process.": "Fare clic qui per ulteriori informazioni su questo processo.",
    "feed last value:": "feed ultimo valore:",
    "input last value:": "inserire l'ultimo valore:",
    "Move down": "Sposta giù",
    "Move up": "Sposta su",
    "<p><b>Log to feed:<\/b> This processor logs to a timeseries feed which can then be used to explore historic data. This is recommended for logging power, temperature, humidity, voltage and current data.<\/p><p><b>Feed engine:<\/b><ul><li><b>PHPFina<\/b> is the recommended feed engine it is a basic fixed interval timeseries engine.<\/li><li><b>PHPTimeseries<\/b> is for data posted at a non regular interval such as on state change.<\/li><\/ul><\/p><p><b>Feed interval:<\/b> When selecting the feed interval select an interval that is the same as, or longer than the update rate that is set in your monitoring equipment. Setting the interval rate to be shorter than the update rate of the equipment causes un-needed disk space to be used up.<\/p>": "<p><b>Registra al feed:<\/b> Questo processore accede a un feed timeseries che può quindi essere utilizzato per esplorare i dati storici. Questo è consigliato per la registrazione di dati di potenza, temperatura, umidità, tensione e corrente.<\/p><p><b>Motore di alimentazione:<\/b><ul><li><b>PHPFina<\/b> è il motore di alimentazione consigliato è un motore timeseries a intervalli fissi di base.<\/li><li><b>PHPTimeseries<\/b> è per i dati pubblicati a intervalli non regolari, ad esempio in seguito alla modifica dello stato.<\/li><\/ul><\/p><p><b>Intervallo di avanzamento:<\/b> Quando si seleziona l'intervallo di avanzamento, selezionare un intervallo uguale o superiore alla frequenza di aggiornamento impostata nell'apparecchiatura di monitoraggio. L'impostazione della frequenza di intervallo è inferiore alla frequenza di aggiornamento dell'apparecchiatura causa l'utilizzo dello spazio su disco non necessario.<\/p>",
    "<p><b>Power to kWh:<\/b> Convert a power value in Watts to a cumulative kWh feed.<br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1. See <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "<p><b>Potenza a kWh:<\/b> Convertire un valore di potenza in Watt in un feed cumulativo kWh.<br><br><b>Suggerimento per la visualizzazione:<\/b> I feed creati con questo processore di input possono essere utilizzati per generare dati kWh giornalieri utilizzando la visualizzazione BarGraph con la proprietà delta impostata su 1. Vedere <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guida: kWh giornaliero<\/a><br><br>",
    "Creates a histogram of energy binned by power ranges. For each power range on the x-axis, this processor will aggregate the total energy of the stream while it was in that power range.<p><b>Input<\/b>: power in Watts.<\/p>": "Crea un istogramma di energia rialfato da intervalli di alimentazione. Per ogni intervallo di potenza sull'asse x, questo processore aggregherà l'energia totale del flusso mentre era in tale intervallo di potenza.<p><b>Ingresso<\/b>: potenza in Watt.<\/p>",
    "<b>Wh Accumulator:<\/b> Use with emontx, emonth or emonpi pulsecount or an emontx running firmware <i>emonTxV3_4_continuous_kwhtotals<\/i> sending cumulative watt hours.<br><br>This processor ensures that when the emontx is reset the watt hour count in emoncms does not reset, it also checks filter's out spikes in energy use that are larger than a max power threshold set in the processor, assuming these are error's, the max power threshold is set to 60 kW. <br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1 and scale set to 0.001. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "<b>Accumulatore Wh:<\/b> Utilizzare con emontx, emonth o emonpi pulsecount o un firmware in esecuzione emontx <i>emonTxV3_4_continuous_kwhtotals<\/i> l'invio di ore cumulative watt.<br><br>Questo processore assicura che quando l'emontx viene reimpostato il conteggio dell'ora watt in emoncms non viene reimpostato, controlla anche i picchi di uscita del filtro nell'utilizzo dell'energia che sono superiori a una soglia di alimentazione massima impostata nel processore, supponendo che si tratti di errori, viene impostata la soglia di alimentazione massima a 25 kW.<br><br><b>Suggerimento per la visualizzazione:<\/b> I feed creati con questo processore di input possono essere utilizzati per generare dati kWh giornalieri utilizzando la visualizzazione BarGraph con la proprietà delta impostata su 1 e la scalabilità impostata su 0,001. Vedere: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guida: kWh giornaliero<\/a><br><br>",
    "Publish to MQTT": "Pubblica su MQTT",
    "<p>Publishes value to MQTT topic e.g. 'home\/power\/kitchen'<\/p>": "<p>Pubblica valore sull'argomento MQTT, ad esempio \"casa\/potenza\/cucina\"<\/p>",
    "<b>kWh Accumulator:<\/b>This processor removes resets from a cumulative kWh input, it also filter's out spikes in energy use that are larger than a max power threshold set in the processor, assuming these are error's, the max power threshold is set to 60 kW. <br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1 and scale set to 0.001. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "<b>Accumulatore kWh:<\/b> Questo processore rimuove le resezze da un ingresso cumulativo kWh, ma filtra anche i picchi di uscita del consumo energetico che superano una soglia di alimentazione massima impostata nel processore, supponendo che si tratti di errori, la soglia di alimentazione massima è impostata su 60 kW.<br><br><b>Suggerimento per la visualizzazione:<\/b> I feed creati con questo processore di input possono essere utilizzati per generare dati kWh giornalieri utilizzando la visualizzazione BarGraph con la proprietà delta impostata su 1 e la scalabilità impostata su 0,001. Vedere: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guida: kWh giornaliero<\/a><br><br>",
    "<p><b>Log to feed (Join):<\/b> In addition to the standard log to feed process, this process links missing data points with a straight line between the newest value and the previous value. It is designed for use with total cumulative kWh meter reading inputs, producing a feed that can be used with the delta property when creating bar graphs. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "<p><b>Registra al feed (Partecipa):<\/b> Oltre al processo di log standard per il feed, questo processo collega i punti dati mancanti con una linea retta tra il valore più recente e il valore precedente. È progettato per l'uso con gli input di lettura totale del contatore kWh cumulativo, producendo un feed che può essere utilizzato con la proprietà delta durante la creazione di grafici a barre. Vedere: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guida: kWh giornaliero<\/a><br><br>"
}