{
    "Process API": "API di Processo",
    "Apikey authentication": "Apikey autenticazione",
    "If you want to call any of the following actions when your not logged in you have this options to authenticate with the API key:": "Se si desidera chiamare una delle seguenti azioni quando non è connesso, sono disponibili queste opzioni per l'autenticazione con la chiave API:",
    "Append on the URL of your request: &apikey=APIKEY": "Aggiungi all'URL della tua richiesta: &apikey=APIKEY",
    "Use POST parameter: \"apikey=APIKEY\"": "Utilizzare il parametro POST: \"apikey=APIKEY\"",
    "Add the HTTP header: \"Authorization: Bearer APIKEY\"": "Aggiungere l'intestazione HTTP: \"Authorization: Bearer APIKEY\"",
    "Read only:": "Sola lettura:",
    "Read & Write:": "Lettura & Scrittura",
    "Available HTML URLs": "URL HTML disponibili",
    "This page": "Questa pagina",
    "Available JSON commands": "Comandi JSON disponibili",
    "To use the json api the request url needs to include <b>.json<\/b>": "Per usare l'API json, l'URL della richiesta deve includere <b>.json<\/b>",
    "Process actions": "Azioni di processo",
    "List all supported process": "Lista dei processi supportati",
    "process list setup": "impostazione dell'elenco processi",
    "Processes are executed sequentially with the result value being passed down for further processing to the next processor on this processing list.": "I processi vengono eseguiti in sequenza con il valore del risultato passato per un'ulteriore elaborazione al processore successivo in questo elenco di elaborazione.",
    "You have no processes defined": "Non hai processi definiti",
    "Order": "Ordinamento",
    "Process": "Processo",
    "Latest": "Più recenti",
    "Actions": "Azioni",
    "Add process": "Aggiungi processo",
    "Edit process": "Modifica processo",
    "Type value...": "Valore di tipo...",
    "Type text...": "Testo digita...",
    "Input": "Input",
    "Schedule": "Pianificazione",
    "Feed": "Feed",
    "Tag": "Tag",
    "Name": "Nome",
    "Engine": "Motore",
    "Select interval": "Seleziona intervallo",
    "Add": "Aggiungi",
    "Edit": "Modifica",
    "Cancel": "Annulla",
    "Close": "Chiudi",
    "Not modified": "Non modificato",
    "Changed, press to save": "Modificato, premere per salvare",
    "Delete": "Elimina",
    "Does NOT modify value passed onto next process step.": "NON modifica il valore passato al passaggio successivo del processo.",
    "Modified value passed onto next process step.": "Valore modificato passato al passaggio successivo del processo.",
    "Requires REDIS.": "Richiede REDIS.",
    "Saved": "Salvato",
    "Log to feed": "Registra al feed",
    "Main": "Principale",
    "x": "x",
    "Calibration": "Calibrazione",
    "<p>Multiplies current value by given constant. This can be useful for calibrating a particular variable on the web rather than by reprogramming hardware.<\/p>": "<p>Moltiplica il valore corrente per la costante specificata. Ciò può essere utile per calibrare una particolare variabile sul Web anziché riprogrammare l'hardware.<\/p>",
    "+": "+",
    "<p>Offset current value by given value. This can again be useful for calibrating a particular variable on the web rather than by reprogramming hardware.<\/p>": "<p>Offset del valore corrente in base al valore specificato. Questo può essere di nuovo utile per calibrare una particolare variabile sul web piuttosto che riprogrammando l'hardware.<\/p>",
    "Power to kWh": "Potenza a kWh",
    "Power to kWh\/d": "Potenza a kWh\/d",
    "Power & Energy": "Potenza & Energia",
    "<p>Convert a power value in Watts to a feed that contains an entry for the total energy used each day (kWh\/d)<\/p>": "<p>Convertire un valore di potenza in Watt in un feed che contiene una voce per l'energia totale utilizzata ogni giorno (kWh\/d)<\/p>",
    "x input": "x input",
    "<p>Multiplies the current value with the last value from other input as selected from the input list.<\/p>": "<p>Moltiplica il valore corrente con l'ultimo valore di un altro input selezionato dall'elenco di input.<\/p>",
    "Input on-time": "Ingresso puntuale",
    "<p>Counts the amount of time that an input is high in each day and logs the result to a feed. Created for counting the number of hours a solar hot water pump is on each day<\/p>": "<p>Conta la quantità di tempo per cui un input è elevato in ogni giorno e registra il risultato in un feed. Creato per il conteggio del numero di ore in cui una pompa di acqua calda solare è su ogni giorno<\/p>",
    "Wh increments to kWh\/d": "Incrementi di Wh a kWh\/d",
    "<p>Accumulate Wh measurements into kWh\/d.<p><b>Input<\/b>: energy increments in Wh.<\/p>": "<p>Accumulare le misurazioni Wh in kWh\/d.<p><b>Ingresso<\/b>: incrementi di energia in Wh.<\/p>",
    "kWh to kWh\/d (OLD)": "kWh a kWh\/d (VECCHIO)",
    "Deleted": "Eliminato",
    "Update feed at day": "Aggiorna feed al giorno",
    "<p>Updates or inserts daily value on the specified time (given by the JSON time parameter from the API) of the specified feed<\/p>": "<p>Aggiorna o inserisce il valore giornaliero nell'ora specificata (specificata dal parametro dell'ora JSON dall'API) del feed specificato<\/p>",
    "+ input": "+ input",
    "<p>Adds the current value with the last value from other input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Aggiunge il valore corrente con l'ultimo valore di un altro input selezionato dall'elenco di input. Il risultato viene passato nuovamente per un'ulteriore elaborazione dal processore successivo nell'elenco di elaborazione.<\/p>",
    "\/ input": "\/ input",
    "<p>Divides the current value with the last value from other input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Divide il valore corrente con l'ultimo valore di un altro input selezionato dall'elenco di input. Il risultato viene passato nuovamente per un'ulteriore elaborazione dal processore successivo nell'elenco di elaborazione.<\/p>",
    "Phaseshift": "Slittamento di fase",
    "Accumulator": "Accumulatore",
    "Misc": "Varie",
    "<p>Output feed accumulates by input value<\/p>": "<p>L'avanzamento di uscita si accumula in base al valore di input<\/p>",
    "Rate of change": "Tasso di variazione",
    "<p>Output feed is the difference between the current value and the last<\/p>": "<p>L'alimentazione di output è la differenza tra il valore corrente e l'ultimo<\/p>",
    "Histogram": "Istogramma",
    "Daily Average": "Media Giornaliera",
    "Heat flux": "Flusso di calore",
    "Power gained to kWh\/d": "Potenza acquisita a kWh\/d",
    "Total pulse count to pulse increment": "Conteggio impulsi totale per l'incremento dell'impulso",
    "Pulse": "Impulso",
    "<p>Returns the number of pulses incremented since the last update for a input that is a cumulative pulse count. i.e If the input updates from 23400 to 23410 the result will be an incremenet of 10.<\/p>": "<p>Restituisce il numero di impulsi incrementati dall'ultimo aggiornamento per un input che è un numero di impulsi cumulativo. vale a dire Se l'input aggiorna da 23400 a 23410 il risultato sarà un incremenet di 10.<\/p>",
    "kWh to Power": "kWh a Potenza",
    "<p>Convert accumulating kWh to instantaneous power<\/p>": "<p>Convertire kWh accumulando in potenza istantanea<\/p>",
    "- input": "- input",
    "<p>Subtracts from the current value the last value from other input as selected from the input list.<\/p>": "<p>Sottrae dal valore corrente l'ultimo valore da un altro input selezionato dall'elenco di input.<\/p>",
    "kWh to kWh\/d": "kWh a kWh\/d",
    "<p>Upsert kWh to a daily value.<\/p>": "<p>Upsert kWh a un valore giornaliero.<\/p>",
    "Allow positive": "Permetti positivi",
    "Limits": "Limiti",
    "<p>Negative values are zeroed for further processing by the next processor in the processing list.<\/p>": "<p>I valori negativi vengono azzerati per un'ulteriore elaborazione da parte del processore successivo nell'elenco di elaborazione.<\/p>",
    "Allow negative": "Permetti negativi",
    "<p>Positive values are zeroed for further processing by the next processor in the processing list.<\/p>": "<p>I valori positivi vengono azzerati per un'ulteriore elaborazione dal processore successivo nell'elenco di elaborazione.<\/p>",
    "Signed to unsigned": "Con segno a senza segno",
    "<p>Convert a number that was interpreted as a 16 bit signed number to an unsigned number.<\/p>": "<p>Convertire un numero che è stato interpretato come un numero con segno a 16 bit in un numero senza segno.<\/p>",
    "Max daily value": "Valore Max giornaliero",
    "<p>Maximal daily value. Upserts on the selected daily feed the highest value reached each day.<\/p>": "<p>Massimo valore giornaliero. Aumenta il feed giornaliero selezionato con il valore più alto raggiunto ogni giorno.<\/p>",
    "Min daily value": "Valore Min giornaliero",
    "<p>Minimal daily value. Upserts on the selected daily feed the lowest value reached each day.<\/p>": "<p>Minimo valore giornaliero. Aumenta il feed giornaliero selezionato con il valore più basso raggiunto ogni giorno.<\/p>",
    "+ feed": "+ feed",
    "<p>Adds the current value with the last value from a feed as selected from the feed list.<\/p>": "<p>Aggiunge il valore corrente con l'ultimo valore di un feed selezionato dall'elenco dei feed.<\/p>",
    "- feed": "- feed",
    "<p>Subtracts from the current value the last value from a feed as selected from the feed list.<\/p>": "<p>Sottrae dal valore corrente l'ultimo valore di un feed selezionato dall'elenco di feed.<\/p>",
    "* feed": "* feed",
    "<p>Multiplies the current value with the last value from a feed as selected from the feed list.<\/p>": "<p>Moltiplica il valore corrente con l'ultimo valore di un feed selezionato dall'elenco dei feed.<\/p>",
    "\/ feed": "\/ feed",
    "<p>Divides the current value by the last value from a feed as selected from the feed list.<\/p>": "<p>Divide il valore corrente per l'ultimo valore di un feed selezionato dall'elenco dei feed.<\/p>",
    "Reset to ZERO": "Reset a ZERO",
    "<p>The value \"0\" is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Il valore \"0\" viene passato nuovamente per un'ulteriore elaborazione dal processore successivo nell'elenco di elaborazione.<\/p>",
    "Wh Accumulator": "Accumulatore Wh",
    "Reset to NULL": "Reset a NULL",
    "<p>Value is set to NULL.<\/p><p>Useful for conditional process to work on.<\/p>": "<p>Il valore è impostato su NULL.<\/p><p>Utile per il processo condizionale su cui lavorare.<\/p>",
    "Reset to Original": "Reset a Originale",
    "<p>The value is set to the original value at the start of the process list.<\/p>": "<p>Il valore viene impostato sul valore originale all'inizio dell'elenco di processi.<\/p>",
    "If ZERO, skip next": "Se ZERO, salta il prossimo",
    "Conditional": "Condizionale",
    "<p>If value from last process is ZERO, process execution will skip execution of next process in list.<\/p>": "<p>Se il valore dell'ultimo processo è zero, l'esecuzione del processo ignorerà l'esecuzione del processo successivo nell'elenco.<\/p>",
    "If !ZERO, skip next": "Se !ZERO, salta il prossimo",
    "<p>If value from last process is NOT ZERO, process execution will skip execution of next process in list.<\/p>": "<p>Se il valore dell'ultimo processo non è zero, l'esecuzione del processo ignorerà l'esecuzione del processo successivo nell'elenco.<\/p>",
    "If NULL, skip next": "Se NULL, salta il prossimo",
    "<p>If value from last process is NULL, process execution will skip execution of next process in list.<\/p>": "<p>Se il valore dell'ultimo processo è NULL, l'esecuzione del processo ignorerà l'esecuzione del processo successivo nell'elenco.<\/p>",
    "If !NULL, skip next": "Se !NULL, salta il prossimo",
    "<p>If value from last process is NOT NULL, process execution will skip execution of next process in list.<\/p>": "<p>Se il valore dell'ultimo processo non è NULL, l'esecuzione del processo ignorerà l'esecuzione del processo successivo nell'elenco.<\/p>",
    "If >, skip next": "Se >, salta il prossimo",
    "Conditional - User value": "Condizionale - Valore utente",
    "<p>If value from last process is greater than the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Se il valore dell'ultimo processo è maggiore del valore specificato, l'esecuzione del processo ignorerà l'esecuzione del processo successivo nell'elenco.<\/p>",
    "If >=, skip next": "Se >=, salta il prossimo",
    "<p>If value from last process is greater or equal to the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Se il valore dell'ultimo processo è maggiore o uguale al valore specificato, l'esecuzione del processo ignorerà l'esecuzione del processo successivo nell'elenco.<\/p>",
    "If <, skip next": "Se <, salta il prossimo",
    "<p>If value from last process is lower than the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Se il valore dell'ultimo processo è inferiore al valore specificato, l'esecuzione del processo ignorerà l'esecuzione del processo successivo nell'elenco.<\/p>",
    "If <=, skip next": "Se <=, salta il prossimo",
    "<p>If value from last process is lower or equal to the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Se il valore dell'ultimo processo è inferiore o uguale al valore specificato, l'esecuzione del processo ignorerà l'esecuzione del processo successivo nell'elenco.<\/p>",
    "If =, skip next": "Se =, salta il prossimo",
    "<p>If value from last process is equal to the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Se il valore dell'ultimo processo è uguale al valore specificato, l'esecuzione del processo ignorerà l'esecuzione del processo successivo nell'elenco.<\/p>",
    "If !=, skip next": "Se !=, salta il prossimo",
    "<p>If value from last process is NOT equal to the specified value, process execution will skip execution of next process in list.<\/p>": "<p>Se il valore dell'ultimo processo NON è uguale al valore specificato, l'esecuzione del processo ignorerà l'esecuzione del processo successivo nell'elenco.<\/p>",
    "GOTO": "GOTO",
    "<p>Jumps the process execution to the specified position.<\/p><p><b>Warning<\/b><br>If you're not careful you can create a goto loop on the process list.<br>When a loop occurs, the API will appear to lock until the server php times out with an error.<\/p>": "<p>Salta l'esecuzione del processo nella posizione specificata.<\/p><p><b>Avviso<\/b><br>Se non stai attento, puoi creare un ciclo goto nell'elenco dei processi.<br>Quando si verifica un ciclo, l'API sembrerà bloccarsi fino al timeout del server php con un errore.<\/p>",
    "Source Feed": "+ source feed",
    "Virtual": "Virtuale",
    "<p><b>Source Feed:<\/b><br>Virtual feeds should use this processor as the first one in the process list. It sources data from the selected feed.<br>The sourced value is passed back for further processing by the next processor in the processing list.<br>You can then add other processors to apply logic on the passed value for post-processing calculations in realtime.<\/p><p>Note: This virtual feed process list is executed on visualizations requests that use this virtual feed.<\/p>": "<p><b>Feed di origine:<\/b><br>I feed virtuali devono usare questo processore come primo nell'elenco dei processi. Fornisce dati dal feed selezionato.<br>Il valore di origine viene passato nuovamente per un'ulteriore elaborazione dal processore successivo nell'elenco di elaborazione.<br>È quindi possibile aggiungere altri processori per applicare la logica al valore passato per i calcoli di post-elaborazione in tempo reale.<\/p><p>Nota: questo elenco di processi di feed virtuali viene eseguito sulle richieste di visualizzazione che utilizzano questo feed virtuale.<\/p>",
    "+ source feed": "+ source feed",
    "<p>Add the specified feed.<\/p>": "<p>Aggiungere il feed specificato.<\/p>",
    "- source feed": "- source feed",
    "<p>Subtract the specified feed.<\/p>": "<p>Sottrarre il feed specificato.<\/p>",
    "* source feed": "* source feed",
    "<p>Multiply by specified feed.<\/p>": "<p>Moltiplica per il feed specificato.<\/p>",
    "\/ source feed": "\/ source feed",
    "<p>Divide by specified feed. Returns NULL for zero values.<\/p>": "<p>Dividere per il feed specificato. Restituisce NULL per i valori zero.<\/p>",
    "<p>Return the reciprical of the specified feed. Returns NULL for zero values.<\/p>": "<p>Restituisce il reciprical del feed specificato. Restituisce NULL per i valori zero.<\/p>",
    "EXIT": "EXIT",
    "Hidden": "Nascosto",
    "<p>This was automaticaly added when a loop error was discovered on the processList or execution took too many steps to process.  Review the usage of GOTOs or decrease the number of items and delete this entry to resume execution.<\/p>": "<p>Questo è stato aggiunto automaticamente quando è stato rilevato un errore di ciclo nel processList o l'esecuzione ha richiesto troppi passaggi per l'elaborazione.  Esaminare l'utilizzo dei GOTO o ridurre il numero di elementi ed eliminare questa voce per riprendere l'esecuzione.<\/p>",
    "Max value allowed": "Valore massimo consentitoMax value allowed",
    "<p>If value is greater than <i>max value allowed<\/i> then the value passed to following process will be the <i>max value allowed<\/i><\/p>": "<p>Se il valore è maggiore del <i>valore massimo consentito,<\/i> il valore passato al processo seguente sarà il <i>valore massimo consentito<\/i><\/p>",
    "Min value allowed": "Valore minimo consentito",
    "<p>If value is lower than <i>min value allowed<\/i> then the value passed to following process will be the <i>min value allowed<\/i><\/p>": "<p>Se il valore è inferiore al <i>valore minimo consentito,<\/i> il valore passato al processo seguente sarà il <i>valore minimo consentito<\/i><\/p>",
    "Absolute value": "Valore assoluto",
    "<p>Return the absolute value of the current value. This can be useful for calibrating a particular variable on the web rather than by reprogramming hardware.<\/p>": "<p>Restituisce il valore assoluto del valore corrente. Ciò può essere utile per calibrare una particolare variabile sul Web anziché riprogrammare l'hardware.<\/p>",
    "kWh Accumulator": "Accumulatore kWh",
    "Log to feed (Join)": "Registra al feed (Partecipa)",
    "<p>This processor logs to a timeseries feed which can then be used to explore historic data. This is recommended for logging power, temperature, humidity, voltage and current data.<\/p><p><b>Feed engine:<\/b><ul><li><b>Emoncms Fixed Interval TimeSeries (PHPFina)<\/b> is the recommended feed engine, it is a fixed interval timeseries engine.<\/li><li><b>Emoncms Variable Interval TimeSeries (PHPTimeseries)<\/b> is for data posted at a non regular interval.<\/li><\/ul><\/p><p><b>Feed interval:<\/b> When selecting the feed interval select an interval that is the same as, or longer than the update rate that is set in your monitoring equipment. Setting the interval rate to be shorter than the update rate of the equipment causes un-needed disk space to be used up.<\/p>": "<p>This processor logs to a timeseries feed which can then be used to explore historic data. This is recommended for logging power, temperature, humidity, voltage and current data.<\/p><p><b>Feed engine:<\/b><ul><li><b>Emoncms Fixed Interval TimeSeries (PHPFina)<\/b> is the recommended feed engine, it is a fixed interval timeseries engine.<\/li><li><b>Emoncms Variable Interval TimeSeries (PHPTimeseries)<\/b> is for data posted at a non regular interval.<\/li><\/ul><\/p><p><b>Feed interval:<\/b> When selecting the feed interval select an interval that is the same as, or longer than the update rate that is set in your monitoring equipment. Setting the interval rate to be shorter than the update rate of the equipment causes un-needed disk space to be used up.<\/p>",
    "<p>Convert a power value in Watts to a cumulative kWh feed.<br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1. See <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "<p>Convert a power value in Watts to a cumulative kWh feed.<br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1. See <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>",
    "Use with emontx, emonth or emonpi pulsecount or an emontx running firmware <i>emonTxV3_4_continuous_kwhtotals<\/i> sending cumulative watt hours.<br><br>This processor ensures that when the emontx is reset the watt hour count in emoncms does not reset, it also checks filter's out spikes in energy use that are larger than a max power threshold set in the processor, assuming these are error's, the max power threshold is set to 60 kW. <br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1 and scale set to 0.001. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "Use with emontx, emonth or emonpi pulsecount or an emontx running firmware <i>emonTxV3_4_continuous_kwhtotals<\/i> sending cumulative watt hours.<br><br>This processor ensures that when the emontx is reset the watt hour count in emoncms does not reset, it also checks filter's out spikes in energy use that are larger than a max power threshold set in the processor, assuming these are error's, the max power threshold is set to 60 kW. <br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1 and scale set to 0.001. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>",
    "Publish to MQTT via Redis": "Publish to MQTT via Redis",
    "<p>Publishes value to REDIS for phpmqtt_input.php to publish the values to MQTT topic e.g. 'home\/power\/kitchen'<\/p>": "<p>Publishes value to REDIS for phpmqtt_input.php to publish the values to MQTT topic e.g. 'home\/power\/kitchen'<\/p>",
    "This processor removes resets from a cumulative kWh input, it also filter's out spikes in energy use that are larger than a max power threshold set in the processor, assuming these are error's, the max power threshold is set to 60 kW. <br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1 and scale set to 0.001. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "This processor removes resets from a cumulative kWh input, it also filter's out spikes in energy use that are larger than a max power threshold set in the processor, assuming these are error's, the max power threshold is set to 60 kW. <br><br><b>Visualisation tip:<\/b> Feeds created with this input processor can be used to generate daily kWh data using the BarGraph visualisation with the delta property set to 1 and scale set to 0.001. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>",
    "<p>In addition to the standard log to feed process, this process links missing data points with a straight line between the newest value and the previous value. It is designed for use with total cumulative kWh meter reading inputs, producing a feed that can be used with the delta property when creating bar graphs. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>": "<p>In addition to the standard log to feed process, this process links missing data points with a straight line between the newest value and the previous value. It is designed for use with total cumulative kWh meter reading inputs, producing a feed that can be used with the delta property when creating bar graphs. See: <a href='https:\/\/guide.openenergymonitor.org\/setup\/daily-kwh\/' target='_blank' rel='noopener'>Guide: Daily kWh<\/a><br><br>",
    "max by input": "max by input",
    "<p>Limits the current value by the last value from an input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Limits the current value by the last value from an input as selected from the input list. The result is passed back for further processing by the next processor in the processing list.<\/p>",
    "min by input": "min by input",
    "max by feed": "max by feed",
    "<p>Limits the current value by the last value from an feed as selected from the feed list. The result is passed back for further processing by the next processor in the processing list.<\/p>": "<p>Limits the current value by the last value from an feed as selected from the feed list. The result is passed back for further processing by the next processor in the processing list.<\/p>",
    "min by feed": "min by feed",
    "Power to kWh\/15min": "Power to kWh\/15min",
    "<p>Convert a power value in Watts to a feed that contains an entry for the total energy used every 15 min (starting mid night) (kWh\/15min)<\/p>": "<p>Convert a power value in Watts to a feed that contains an entry for the total energy used every 15 min (starting mid night) (kWh\/15min)<\/p>",
    "Power to kWh \/ custom minutes": "Power to kWh \/ custom minutes",
    "Slot in minutes slot to accumulate": "Slot in minutes slot to accumulate",
    "Output feed": "Output feed",
    "<p>Convert a power value in Watts to a feed that contains an entry for the total energy used every selected minutes (starting mid night) (kWh\/x min)<\/p>": "<p>Convert a power value in Watts to a feed that contains an entry for the total energy used every selected minutes (starting mid night) (kWh\/x min)<\/p>",
    "Invalid process list format: ": "Invalid process list format: ",
    "Process list must be an array": "Process list must be an array",
    "Missing process key in process list at index $index": "Missing process key in process list at index $index",
    "Invalid or missing args in process list at index $index": "Invalid or missing args in process list at index $index",
    "Invalid process process key:$process_key": "Invalid process process key:$process_key",
    "Invalid number of arguments for process: $processkey": "Invalid number of arguments for process: $processkey",
    "Invalid feed": "Invalid feed",
    "Invalid input": "Invalid input",
    "Cut": "Cut",
    "Copy": "Copy",
    "Paste": "Paste",
    "Hover over the short names below to get the full description": "Hover over the short names below to get the full description",
    "Arguments": "Arguments",
    "Please enter a feed tag consisting of alphabetical letters, A-Z a-z 0-9 - _ : and spaces": "Please enter a feed tag consisting of alphabetical letters, A-Z a-z 0-9 - _ : and spaces",
    "Please enter a feed name consisting of alphabetical letters, A-Z a-z 0-9 - _ : and spaces": "Please enter a feed name consisting of alphabetical letters, A-Z a-z 0-9 - _ : and spaces",
    "Please enter a table name consisting of alphabetical letters, A-Z a-z 0-9 and _ characters": "Please enter a table name consisting of alphabetical letters, A-Z a-z 0-9 and _ characters",
    "Table": "Table",
    "Click here for additional information about this process": "Click here for additional information about this process",
    "Output:": "Output:",
    "REDIS:": "REDIS:"
}