{
    "Error setting processlist": "Gwall wrth osod rhestr broses",
    "Inputs": "Mewnbynnau",
    "Delete Input": "Dileu Mewnbwn",
    "Deleting an Input will lose it name and configured Processlist.<br>A new blank input is automatic created by API data post if it does not already exists.": "Bydd dileu Mewnbwn yn colli ei enw a'r Rhestr Broses a ffurfweddwyd.<br>Mae mewnbwn gwag newydd yn cael ei greu'n awtomatig gan bost data API os nad yw eisoes yn bodoli.",
    "Are you sure you want to delete?": "Ydych chi'n siŵr eich bod eisiau dileu?",
    "Cancel": "Canslo",
    "Edit Input": "Golygu Mewnbwn",
    "Name": "Enw",
    "Description": "Disgrifiad",
    "Save": "Cadw",
    "Close": "Cau",
    "Save All": "Cadw Popeth",
    "Basic text only. Symbols allowed _-.@": "Testun sylfaenol yn unig. Symbolau a ganiateir _-.@",
    "name": "enw",
    "description": "disgrifiad",
    "Input API": "API Mewnbwn",
    "Apikey authentication": "Dilysu allwedd API",
    "Append on the URL of your request: &apikey=APIKEY": "Ychwanegu at URL eich cais: &apikey=APIKEY",
    "Alternatively, use the encrypted input method to post data with higher security.": "Fel arall, defnyddiwch y dull mewnbwn amgryptedig i bostio data gyda diogelwch uwch.",
    "Read only:": "Darllen yn unig:",
    "Read & Write:": "Darllen ac Ysgrifennu:",
    "Posting data to EmonCMS": "Postio data i EmonCMS",
    "The EmonCMS HTTP input API provides three ways of sending data to EmonCMS:": "Mae API mewnbwn HTTP EmonCMS yn darparu tri ffordd o anfon data i EmonCMS:",
    "<b>input\/post<\/b> - Post a single update from a node as either one data item or as a JSON data structure.": "<b>input\/post<\/b> - Postio diweddariad sengl o nod fel un eitem data neu fel strwythur data JSON.",
    "<b>input\/bulk<\/b> - Bulk upload historic data from multiple nodes in a single update.": "<b>input\/bulk<\/b> - Uwchlwytho swmp data hanesyddol o nodau lluosog mewn un diweddariad.",
    "<b>encryption<\/b> - An encrypted version of both of the above.": "<b>encryption<\/b> - Fersiwn amgryptedig o'r ddau uchod.",
    "For applications where HTTPS or TLS is not available, EmonCMS offers an in-built transport layer encryption solution where the EmonCMS apikey is used as the pre-shared key for encrypting the data with AES-128-CBC.": "Ar gyfer cymwysiadau lle nad yw HTTPS neu TLS ar gael, mae EmonCMS yn cynnig datrysiad amgryptio haen cludiant adeiledig lle mae allwedd API EmonCMS yn cael ei defnyddio fel yr allwedd rhanedig ymlaen llaw ar gyfer amgryptio'r data gyda AES-128-CBC.",
    "input\/post": "input\/post",
    "The <b>fulljson<\/b> format is recommended for new integrations. It uses the PHP JSON decoder and the answer is also in json.": "Mae'r fformat <b>fulljson<\/b> yn cael ei argymell ar gyfer integreiddiadau newydd. Mae'n defnyddio dadgodwr JSON PHP ac mae'r ateb hefyd yn json.",
    "The <b>json like<\/b> format is based on the CSV input parsing implementation and maintained for backward compatibility.": "Mae'r fformat <b>json like<\/b> yn seiliedig ar y gweithrediad dosrannu mewnbwn CSV ac yn cael ei gynnal ar gyfer cydnawsedd yn ôl.",
    "The <b>node<\/b> parameter can be an unquoted string e.g: emontx or a number e.g: 10.": "Gall y paramedr <b>node<\/b> fod yn llinyn heb ddyfynodau e.e: emontx neu'n rhif e.e: 10.",
    "Time is set as system time unless a <b>time<\/b> element is included. It can be either a parameter &time (unquoted) or as part of the JSON data structure. If both are included the parameter value will take precedence. Time is a UNIX timestamp and can be in seconds or a string PHP can decode (ISO8061 recommended). If you are having problems, ensure you are using seconds not milliseconds. If part of the JSON data structure is a string, the node value will report NULL": "Mae amser yn cael ei osod fel amser system oni bai bod elfen <b>time<\/b> yn cael ei chynnwys. Gall fod naill ai'n baramedr &time (heb ddyfynodau) neu fel rhan o'r strwythur data JSON. Os yw'r ddau yn cael eu cynnwys bydd gwerth y paramedr yn cymryd blaenoriaeth. Mae amser yn stamp amser UNIX a gall fod mewn eiliadau neu'n llinyn y gall PHP ei ddadgodi (ISO8061 yn cael ei argymell). Os ydych chi'n cael problemau, gwnewch yn siŵr eich bod yn defnyddio eiliadau nid milfedau eiliad. Os yw rhan o'r strwythur data JSON yn llinyn, bydd gwerth y nod yn adrodd NULL",
    "The input\/post API is compatible with both GET and POST request methods (POST examples given use curl).": "Mae'r API input\/post yn gydnaws â dulliau cais GET a POST (mae enghreifftiau POST a roddir yn defnyddio curl).",
    "HTTP Method": "Dull HTTP",
    "Example": "Enghraifft",
    "JSON format": "Fformat JSON",
    "JSON format - with time (as a string in this example)": "Fformat JSON - gydag amser (fel llinyn yn yr enghraifft hon)",
    "JSON like format": "Fformat tebyg i JSON",
    "CSV format": "Fformat CSV",
    "Set the input entry time manually": "Gosod amser cofnod y mewnbwn â llaw",
    "Node name as sub-action": "Enw nod fel is-weithred",
    "To post data from a remote device you will need to include in the request url your write apikey. This give your device write access to your emoncms account, allowing it to post data.": "I bostio data o ddyfais bell bydd angen i chi gynnwys yn url y cais eich allwedd API ysgrifennu. Mae hyn yn rhoi mynediad ysgrifennu i'ch dyfais i'ch cyfrif emoncms, gan ganiatáu iddi bostio data.",
    "For example using the first json type request above just add the apikey to the end like this:": "Er enghraifft, gan ddefnyddio'r cais math json cyntaf uchod, ychwanegwch yr allwedd API at y diwedd fel hyn:",
    "JSON format:": "Fformat JSON:",
    "CSV format:": "Fformat CSV:",
    "input\/bulk": "input\/bulk",
    "Efficiently upload multiple updates from multiple nodes.": "Uwchlwytho diweddariadau lluosog o nodau lluosog yn effeithlon.",
    "Method": "Dull",
    "Example request:": "Cais enghreifftiol:",
    "The first number of each node is the time offset (see below).": "Y rhif cyntaf o bob nod yw'r gwyriad amser (gweler isod).",
    "The second number is the node id. This is the unique identifier for the wireless node.": "Yr ail rif yw id y nod. Dyma'r dynodydd unigryw ar gyfer y nod diwifr.",
    "All the numbers after the first two, are data values. The second node here (node 17) has two data values: 1437 and 3164.": "Mae'r holl rifau ar ôl y ddau gyntaf, yn werthoedd data. Mae gan yr ail nod yma (nod 17) ddau werth data: 1437 a 3164.",
    "Optional offset and time parameters allow the sender to set the time reference for the packets. If none is specified, it is assumed that the last packet just arrived. The time for the other packets is then calculated accordingly.": "Mae paramedrau gwyriad ac amser dewisol yn caniatáu i'r anfonwr osod y cyfeirnod amser ar gyfer y pecynnau. Os nad oes un wedi'i bennu, tybir bod y pecyn olaf newydd gyrraedd. Yna cyfrifir amser y pecynnau eraill yn unol â hynny.",
    "Legacy default format (4 is now, 2 is -2 seconds and 0 is -4 seconds to now):": "Fformat rhagosodedig etifeddol (4 yw nawr, 2 yw -2 eiliad a 0 yw -4 eiliad i nawr):",
    "Time offset format (-6 is -16 seconds to now):": "Fformat gwyriad amser (-6 yw -16 eiliad i nawr):",
    "Sentat format: (useful for sending as positive increasing time index)": "Fformat Sentat: (defnyddiol ar gyfer anfon fel mynegai amser cynyddol cadarnhaol)",
    "Absolute time format (-6 is 1387730121 seconds since 1970-01-01 00:00:00 UTC))": "Fformat amser absoliwt (-6 yw 1387730121 eiliad ers 1970-01-01 00:00:00 UTC))",
    "Legacy format:": "Fformat etifeddol:",
    "Time offset format:": "Fformat gwyriad amser:",
    "Sentat format:": "Fformat Sentat:",
    "Absolute time format:": "Fformat amser absoliwt:",
    "Encryption": "Amgryptiad",
    "For applications where HTTPS or TLS is not available, EmonCMS offers an in-built transport layer encryption solution where the emoncms apikey is used as the pre-shared key for encrypting the data with AES-128-CBC.": "Ar gyfer cymwysiadau lle nad yw HTTPS neu TLS ar gael, mae EmonCMS yn cynnig datrysiad amgryptio haen cludiant adeiledig lle mae allwedd API emoncms yn cael ei defnyddio fel yr allwedd rhanedig ymlaen llaw ar gyfer amgryptio'r data gyda AES-128-CBC.",
    "Fetching inputs, updating meta data and other actions": "Nôl mewnbynnau, diweddaru metadata a gweithredoedd eraill",
    "Input get": "Cael mewnbwn",
    "List all nodes and associated inputs:": "Rhestru'r holl nodau a mewnbynnau cysylltiedig:",
    "List inputs for specific node:": "Rhestru mewnbynnau ar gyfer nod penodol:",
    "Fetch specific input from node:": "Nôl mewnbwn penodol o nod:",
    "Input actions": "Gweithredoedd mewnbwn",
    "List of inputs with latest data": "Rhestr o fewnbynnau gyda'r data diweddaraf",
    "Get inputs configuration (last time and value not included)": "Cael ffurfweddiad mewnbynnau (amser olaf a gwerth heb eu cynnwys)",
    "Set input fields": "Gosod meysydd mewnbwn",
    "Delete an input": "Dileu mewnbwn",
    "Clean inputs without a process list": "Glanhau mewnbynnau heb restr broses",
    "Input process actions": "Gweithredoedd proses mewnbwn",
    "Get input process list": "Cael rhestr proses mewnbwn",
    "Set input process list": "Gosod rhestr proses mewnbwn",
    "Reset input process list": "Ailosod rhestr proses mewnbwn",
    "ID": "ID",
    "Value": "Gwerth",
    "Time": "Amser",
    "Updated": "Diweddarwyd",
    "Configure your device here": "Ffurfweddwch eich dyfais yma",
    "Show node key": "Dangos allwedd nod",
    "Configure device using device template": "Ffurfweddu dyfais gan ddefnyddio templed dyfais",
    "Configure Input processing": "Ffurfweddu prosesu Mewnbwn",
    "Saving": "Cadw",
    "Collapse": "Cwympo",
    "Expand": "Ehangu",
    "Select all %s inputs": "Dewis pob %s mewnbwn",
    "Select all": "Dewis popeth",
    "Please install the device module to enable this feature": "Gosodwch y modiwl dyfais i alluogi'r nodwedd hon",
    "Input API Help": "Cymorth API Mewnbwn",
    "Delete": "Dileu",
    "Edit": "Golygu",
    "Show device key": "Dangos allwedd dyfais",
    "No inputs created": "Dim mewnbynnau wedi'u creu",
    "New device": "Dyfais newydd",
    "Loading": "Llwytho",
    "Edit the input's description.": "Golygwch ddisgrifiad y mewnbwn.",
    "If you want to call any of the following actions when you're not logged in, you can authenticate with your API key:": "Os ydych eisiau galw unrhyw un o'r gweithredoedd canlynol pan nad ydych wedi mewngofnodi, gallwch ddilysu gyda'ch allwedd API:",
    "Use POST parameter (Recommended): \"apikey=APIKEY\"": "Defnyddio paramedr POST (Argymhelledig): \"apikey=APIKEY\"",
    "Add the HTTP header: \"Authorization: Bearer APIKEY\"": "Ychwanegu'r pennyn HTTP: \"Authorization: Bearer APIKEY\"",
    "If you're starting out with EmonCMS, 'input\/post' is a good starting point for testing. This was emonCMS' original input method. The EmonPi\/EmonBase uses the 'input\/bulk' input method to post to a remote EmonCMS server as that method provides an option to efficiently upload buffered data after an internet connection outage. Combining multiple updates in a single input\/bulk request also reduces bandwidth requirements. ": "Os ydych chi'n dechrau gyda EmonCMS, mae 'input\/post' yn fan cychwyn da ar gyfer profi. Dyma ddull mewnbwn gwreiddiol emonCMS. Mae'r EmonPi\/EmonBase yn defnyddio'r dull mewnbwn 'input\/bulk' i bostio i weinydd EmonCMS pell gan fod y dull hwnnw'n darparu dewis i uwchlwytho data byrfferiedig yn effeithlon ar ôl toriad cysylltiad rhyngrwyd. Mae cyfuno diweddariadau lluosog mewn un cais input\/bulk hefyd yn lleihau gofynion lled band. ",
    "Named feeds (similar to the main example but updates the keys \"data\" and \"anotherData\" for node 19)": "Porthiant â enw (tebyg i'r prif enghraifft ond yn diweddaru'r allweddi \"data\" ac \"anotherData\" ar gyfer nod 19)",
    "There is a PHP example of how to generate an encrypted request here: ": "Mae enghraifft PHP o sut i gynhyrchu cais amgryptedig yma: ",
    "Inputs are the main entry point for your monitoring device. Configure your device to post values here, you may want to follow the <a href=\"api\">Input API helper<\/a> as a guide for generating your request.": "Mewnbynnau yw'r prif bwynt mynediad ar gyfer eich dyfais fonitro. Ffurfweddwch eich dyfais i bostio gwerthoedd yma, efallai y byddwch eisiau dilyn y <a href=\"api\">Cynorthwywr API Mewnbwn<\/a> fel canllaw ar gyfer cynhyrchu eich cais."
}