{
    "Input API": "API de entrada",
    "Apikey authentication": "Clave de autenticación",
    "If you want to call any of the following actions when your not logged in you have this options to authenticate with the API key:": "Si quiere hacer peticiones a alguna de las siguientes acciones sin estar logueado, tienes estas opciones para autenticarte con la API key:",
    "Append on the URL of your request: &apikey=APIKEY": "Añade a la url de la petición: &apikey=APIKEY",
    "Use POST parameter: \"apikey=APIKEY\"": "Usa el parámetro POST: \"apikey=APIKEY\"",
    "Add the HTTP header: \"Authorization: Bearer APIKEY\"": "Añade la cabecera HTTP:\"Authorization: Bearer APIKEY\"",
    "Read only:": "Sólo lectura:",
    "Read & Write:": "Lectura y escritura:",
    "Available HTML URLs": "Direcciones HTML disponibles",
    "The input list view": "La lista de entradas",
    "This page": "Esta página",
    "Input processing configuration page": "Página de configuración de los procesos sobre la entrada",
    "Available JSON commands": "Comandos JSON disponibles",
    "To use the json api the request url needs to include <b>.json<\/b>": "Para usar la api json la URL de la request debe incluir <b>.json<\/b>",
    "Post data": "Subir datos",
    "JSON format:": "Formato JSON:",
    "CSV format:": "Formato CSV:",
    "Assign inputs to a node group": "Asigne entradas a un grupo de nodos",
    "Set the input entry time manually": "Establezca el momento de ingreso de la entrada manualmente",
    "APIKEY": "APIKEY",
    "To post data from a remote device you will need to include in the request url your write apikey. This give your device write access to your emoncms account, allowing it to post data.": "Para enviar datos dede un dispositivo exterior necesitará incluir en la URL su apikey de escritura. Ésta concede a su dipositivo permisos de escritura en su cuenta emoncms, permitiéndole subir datos.",
    "For example using the first json type request above just add the apikey to the end like this:": "Por ejemplo para usar la petición con el primer tipo de json que aparece arriba sencillamente añada la apikey al final así:",
    "Bulk data": "Cúmulo de datos",
    "You can provide data using bulk mode": "Puedes proporcionar los datos usando un modo masivo",
    "The first number of each node is the time offset (see below).": "EL primer número de cada nodo es el offset temporal (véase abajo).",
    "The second number is the node id, this is the unique identifer for the wireless node.": "El segundo número es el id del nodo, es decir, su identificador unívoco.",
    "All the numbers after the first two are data values. The second node here (node 17) has two data values: 1437 and 3164.": "Todos los números después de los dos primeros son valores de los datos. El segundo nodo aquí (17) tiene dos valores de datos :1437 y 3164.",
    "Optional offset and time parameters allow the sender to set the time reference for the packets. If none is specified, it is assumed that the last packet just arrived. The time for the other packets is then calculated accordingly.": "El offset opcional y los parámetros temporales permiten al emisor fijar la referencia temporal para lo paquetes. Si no especifica nada, se asume que el último paquete acaba de llegar. El tiempo para los otros paquetes se calcula de forma acorde.",
    "Legacy default format (4 is now, 2 is -2 seconds and 0 is -4 seconds to now):": "Formato predeterminado legado (4 es ahora, 2 es -2 segundos y 0 es -4 segundos desde ahora):",
    "Time offset format (-6 is -16 seconds to now):": "Formato de offset temporal (-6 es -16 segundos desde ahora):",
    "Sentat format: (useful for sending as positive increasing time index)": "Formato de envío (útil para ser enviado como índice positivo de tiempo incremental):",
    "Absolute time format (-6 is 1387730121 seconds since 1970-01-01 00:00:00 UTC))": "Formato de tiempo aboluto (-6 es 1387730121 segundos desde 1970-01-01 00:00:00 UTC))",
    "Input actions": "Acciones sobre la entrada",
    "List of inputs with latest data": "LIsta de entradas con los datos más modernos.",
    "Get inputs configuration": "COnfiguración de las entradas",
    "Set input fields": "Modifique los campos de las entradas",
    "Delete an input": "Borrar una entrada",
    "Clean inputs without a process list": "Limpie entradas sin una lista de procesos",
    "Input process actions": "Acciones de procesos de entrada",
    "Get input process list": "Obtener lista de procesos de una fuente",
    "Set input process list": "Modificar lista de procesos de una fuente",
    "Reset input process list": "Inicializar la lista de procesos",
    "Input API Help": "Ver ayuda para el uso de la API",
    "Inputs": "Entradas",
    "No inputs created": "No existen entradas",
    "Inputs are the main entry point for your monitoring device. Configure your device to post values here, you may want to follow the <a href=\"api\">Input API helper<\/a> as a guide for generating your request.": "Las entradas son el principal punto de acceso para su disposotivo de monitorización. Configure su aparato para enviar valores a ellas, quizás quiera seguir la <a href=\"api\">API de ayuda para entradas<\/a> como guía para elaborar tu petición.",
    "Delete Input": "Borrar entrada",
    "Deleting an Input will lose it name and configured Processlist.<br>A new blank input is automatic created by API data post if it does not already exists.": "Borrar una entrada eliminará su nombre y su lista de procesos.<br>Una nueva entrada se crea de forma automática por la API de envío de datos si ésta no existe.",
    "Are you sure you want to delete?": "¿Seguro que quieres borrar?",
    "Cancel": "Cancelar",
    "Delete": "Borrar",
    "Node": "Nodo",
    "Key": "Clave",
    "Name": "Nombre",
    "Process list": "Lista de procesos",
    "Updated": "Actualizado",
    "Value": "Valor"
}