{
    "Input API": "API Source",
    "Apikey authentication": "clé API d'authentification",
    "If you want to call any of the following actions when you're not logged in, you can authenticate with your API key:": "Si vous souhaitez appeler une des actions suivantes alors que vous n'êtes pas connecté, vous devez vous authentifier avec votre clé API :",
    "Use POST parameter (Recommended): \"apikey=APIKEY\"": "Utilisez le paramètre POST (recommandé) \"apikey=APIKEY\".",
    "Add the HTTP header: \"Authorization: Bearer APIKEY\"": "Ajoutez l'en-tête HTTP : \"Authorization: Bearer APIKEY\"",
    "Append on the URL of your request: &apikey=APIKEY": "Ajoutez votre clé d'API à la fin de l'url : &apikey=APIKEY.",
    "Alternatively, use the encrypted input method to post data with higher security.": "Pour plus de sécurité, utilisez la méthode d'entrée cryptée pour publier vos données.",
    "Read only:": "Lecture uniquement :",
    "Read & Write:": "Lecture & Écriture :",
    "Posting data to EmonCMS": "Publication des données dans EmonCMS",
    "The EmonCMS HTTP input API provides three ways of sending data to EmonCMS:": "L'API Source de EmonCMS fournit trois façons d'envoyer les données dans EmonCMS :",
    "<b>input\/post<\/b> - Post a single update from a node as either one data item or as a JSON data structure.": "<b>input\/post<\/b> - Envoi depuis un nœud sous la forme soit d'un élément de données soit d'un objet JSON.",
    "<b>input\/bulk<\/b> - Bulk upload historic data from multiple nodes in a single update.": "<b>input\/bulk<\/b> - Transfert en masse de données provenant de plusieurs nœuds dans un seul envoi.",
    "<b>encryption<\/b> - An encrypted version of both of the above.": "<b>encryption<\/b> - Une version cryptée d'une des deux méthodes ci-dessus.",
    "If you're starting out with EmonCMS, 'input\/post' is a good starting point for testing. This was emonCMS' original input method. The EmonPi\/EmonBase uses the 'input\/bulk' input method to post to a remote EmonCMS server as that method provides an option to efficiently upload buffered data after an internet connection outage. Combining multiple updates in a single input\/bulk request also reduces bandwidth requirements. ": "La méthode 'input\/post' est un bon point de départ pour des tests, c'est la méthode historique, disponible depuis les toutes premières versions d'EmonCMS. EmonPi \/ EmonBase utilise 'input\/bulk' pour envoyer des données vers un serveur EmonCMS distant car cette méthode utilise une mémoire tampon, pour gérer avec le plus de résilience possible les éventuelles pannes de connexion Internet. La possibilité de combiner les données provenant de plusieurs nœuds dans une requête 'input\/bulk' unique réduit également les besoins en bande passante.",
    "For applications where HTTPS or TLS is not available, EmonCMS offers an in-built transport layer encryption solution where the EmonCMS apikey is used as the pre-shared key for encrypting the data with AES-128-CBC.": "Pour les applications où HTTPS ou TLS n'est pas disponible, EmonCMS propose une solution de chiffrement de couche de transport intégrée dans laquelle l'apikey EmonCMS est utilisée comme clé pré-partagée pour le chiffrement des données avec AES-128-CBC.",
    "input\/post": "input\/post",
    "The <b>fulljson<\/b> format is recommended for new integrations. It uses the PHP JSON decoder and the answer is also in json.": "Le format <b>json complet<\/b> est recommandé, il utilise le décodeur PHP JSON et la réponse est également au format json.",
    "The <b>json like<\/b> format is based on the CSV input parsing implementation and maintained for backward compatibility.": "Le format de <b>type json<\/b> est inspiré du format CSV et est maintenu pour une rétrocompatibilité.",
    "The <b>node<\/b> parameter can be an unquoted string e.g: emontx or a number e.g: 10.": "Le paramètre <b>nœud<\/b> peut être une chaîne sans guillemets par ex : emontx ou un nombre par ex : 10.",
    "Time is set as system time unless a <b>time<\/b> element is included. It can be either a parameter &time (unquoted) or as part of the JSON data structure. If both are included the parameter value will take precedence. Time is a UNIX timestamp and can be in seconds or a string PHP can decode (ISO8061 recommended). If you are having problems, ensure you are using seconds not milliseconds. If part of the JSON data structure is a string, the node value will report NULL": "Le temps est paramétré comme temps système à moins qu'un élément <b>temps<\/b> soit inclus. Cela peut être soit un élément &time (sans guillemets) ou une partie de structure de données JSON. Si les deux sont inclus alors la valeur du paramètre est prioritaire. Le temps est un horodatage UNIX et peut être en secondes ou une chaîne que PHP peut décoder (ISO8061 recommandé). Si vous avez des problèmes, vérifiez que vous utilisez des secondes et pas des millisecondes. Si la partie de la structure de données est une chaîne, la valeur du nœud va retourner NULL.",
    "The input\/post API is compatible with both GET and POST request methods (POST examples given use curl).": "L'API input\/post est compatible à la fois avec les méthodes de requête GET et POST (les exemples POST ci-après utilisent curl)",
    "Description": "Description",
    "HTTP Method": "Méthode HTTP",
    "Example": "Exemple",
    "JSON format": "Format JSON",
    "JSON format - with time (as a string in this example)": "Format JSON - avec temps (en tant que chaîne dans cet exemple)",
    "JSON like format": "Format de type JSON",
    "CSV format": "Format CSV",
    "Set the input entry time manually": "Imposer manuellement l'horodatage des données",
    "Node name as sub-action": "Précision du nom de nœud dans la route",
    "To post data from a remote device you will need to include in the request url your write apikey. This give your device write access to your emoncms account, allowing it to post data.": "Pour permettre à un périphérique distant de permettant de poster des données, vous devez ajouter à la fin de l'url votre clé d'API de lecture & écriture.",
    "For example using the first json type request above just add the apikey to the end like this:": "Exemple de route json avec précision de la clé d'écriture :",
    "JSON format:": "Format JSON :",
    "CSV format:": "Format CSV :",
    "input\/bulk": "input\/bulk",
    "Efficiently upload multiple updates from multiple nodes.": "Transfert en masse de données provenant de plusieurs nœuds.",
    "Method": "Méthode",
    "Example request:": "Exemple de requête:",
    "The first number of each node is the time offset (see below).": "Le premier élement du paquet est le décalage temporel (voir ci-dessous).",
    "The second number is the node id. This is the unique identifier for the wireless node.": "Le second élément est l'identifiant unique du nœud.",
    "All the numbers after the first two, are data values. The second node here (node 17) has two data values: 1437 and 3164.": "Tous les élements suivant les deux premiers sont les valeurs de données. Par exemple, ici le second nœud (nœud 17) a deux valeurs : 1437 et 3164.",
    "Optional offset and time parameters allow the sender to set the time reference for the packets. If none is specified, it is assumed that the last packet just arrived. The time for the other packets is then calculated accordingly.": "Les paramètres optionnels de temps et de décalage permettent à l'envoyeur de définir un temps de référence pour les paquets. Si aucun paramètre n'est spécifié, il est considéré que le dernier paquet vient juste d'arriver. L'horodatage pour les autres paquets est alors calculé en conséquence.",
    "Legacy default format (4 is now, 2 is -2 seconds and 0 is -4 seconds to now):": "Format par défaut hérité (4 est maintenant, 2 est -2 secondes et 0 est -4 secondes de maintenant)",
    "Time offset format (-6 is -16 seconds to now):": "Format de décalage de temps (-6 est à -16 secondes de maintenant)",
    "Sentat format: (useful for sending as positive increasing time index)": "Format sentAt: (utile pour un envoi avec index de temps croissant positif)",
    "Absolute time format (-6 is 1387730121 seconds since 1970-01-01 00:00:00 UTC))": "Format de temps absolu (nombre de secondes depuis 1970-01-01 00:00:00 UTC))",
    "Named feeds (similar to the main example but updates the keys \"data\" and \"anotherData\" for node 19)": "Flux nommés (similaire à l'exemple principal mais met à jour les clés \"data\" et \"anotherData\" pour le nœud 19)",
    "Legacy format:": "Format hérité :",
    "Time offset format:": "Format de décalage de temps :",
    "Sentat format:": "Format sentAt :",
    "Absolute time format:": "Format de temps absolu :",
    "Encryption": "Encryption",
    "For applications where HTTPS or TLS is not available, EmonCMS offers an in-built transport layer encryption solution where the emoncms apikey is used as the pre-shared key for encrypting the data with AES-128-CBC.": "Pour les applications où HTTPS ou TLS n'est pas disponible, EmonCMS propose une solution de chiffrement de couche de transport intégrée dans laquelle l'apikey emoncms est utilisée comme clé pré-partagée pour le chiffrement des données avec AES-128-CBC.",
    "There is a PHP example of how to generate an encrypted request here: ": "Exemple de code PHP permettant de générer une requête cryptée : ",
    "Fetching inputs, updating meta data and other actions": "Récupération des sources, mise à jour des métadonnées et autres actions",
    "Input get": "Obtention des sources",
    "List all nodes and associated inputs:": "Lister tous les nœuds et les sources associées :",
    "List inputs for specific node:": "Lister les sources pour un nœud spécifique:",
    "Fetch specific input from node:": "Récupérer une source spécifique du nœud :",
    "Input actions": "Actions sur les sources",
    "List of inputs with latest data": "Lister les sources avec les dernières données",
    "Get inputs configuration (last time and value not included)": "Obtenir la configuration des sources (les derniers temps et valeurs ne sont pas inclus)",
    "Set input fields": "Définir la configuration des sources",
    "Delete an input": "Supprimer une source de données",
    "Clean inputs without a process list": "Nettoyer les sources sans liste de traitement",
    "Input process actions": "Actions sur les traitements des sources de données",
    "Get input process list": "Obtenir la liste des traitements de sources",
    "Set input process list": "Définir la liste des traitements de sources",
    "Reset input process list": "Réinitialiser la liste des traitements de sources",
    "Delete Input": "Supprimer la source",
    "Deleting an Input will lose it name and configured Processlist.<br>A new blank input is automatic created by API data post if it does not already exists.": "La suppression d'une source va entrainer la perte de son nom et de sa liste de traitements configurés. Une nouvelle entrée vide est créée automatiquement lors de la publication de données API si elle n'existe pas déjà.",
    "Are you sure you want to delete?": "Êtes-vous sûr de vouloir supprimer cette source ?",
    "Inputs": "Sources",
    "Cancel": "Annuler",
    "Edit Input": "Modifier la source",
    "Name": "Nom",
    "Save": "Enregistrer",
    "Close": "Fermer",
    "Save All": "Enregistrer tout",
    "Basic text only. Symbols allowed _-.@": "Texte de base seulement. Symboles autorisés _-.@",
    "name": "nom",
    "description": "description",
    "Please install the device module to enable this feature": "Installer SVP le module device pour activer cette fonctionnalité",
    "Collapse": "Replier",
    "Expand": "Étendre",
    "Delete": "Supprimer",
    "Configure your device here": "Configurer votre appareil ici",
    "Saving": "Enregistrement",
    "ID": "Identifiant",
    "Value": "Valeur",
    "Time": "Temps",
    "Updated": "Mise à jour",
    "Show node key": "Afficher la clé du noeud",
    "Configure device using device template": "Configurer l'appareil en utilisant le modèle d'appareil",
    "Configure Input processing": "Configurer le traitement de la source",
    "Select all %s inputs": "Sélectionner l'ensemble des %s sources",
    "Select all": "Tout sélectionner",
    "Input API Help": "Aide de l'API Source",
    "Edit": "Modifier",
    "Show device key": "Afficher la clé de l'appareil",
    "No inputs created": "Aucune source de données n'est disponible",
    "Inputs are the main entry point for your monitoring device. Configure your device to post values here, you may want to follow the <a href=\"api\">Input API helper<\/a> as a guide for generating your request.": "Les sources sont le point d'entrée pour vos appareils de surveillance. Vos appareils doivent être configurés pour envoyer leurs données ici, veuillez consulter l'<a href=\"api\">Aide de l'API Source<\/a> afin de générer votre requête.",
    "New device": "Nouvel appareil",
    "Loading": "Chargement",
    "Error setting processlist": "Erreur lors du paramétrage de la liste des traitements",
    "Edit the input's description.": "Edit the input's description."
}