{
    "Input API": "Input API",
    "Apikey authentication": "Apikey autenticazione",
    "If you want to call any of the following actions when you're not logged in, you can authenticate with your API key:": "Se si desidera chiamare una delle seguenti azioni quando non si è connessi, è possibile eseguire l'autenticazione con la chiave API:",
    "Use POST parameter (Recommended): \"apikey=APIKEY\"": "Utilizzare il parametro POST (consigliato): \"apikey",
    "Add the HTTP header: \"Authorization: Bearer APIKEY\"": "Aggiungere l'intestazione HTTP: \"Authorization: Bearer APIKEY\"",
    "Append on the URL of your request: &apikey=APIKEY": "Aggiunta all'URL della richiesta: &apikey",
    "Alternatively, use the encrypted input method to post data with higher security.": "In alternativa, utilizzare il metodo di input crittografato per inviare dati con maggiore sicurezza.",
    "Read only:": "Sola lettura:",
    "Read & Write:": "Lettura & Scrittura",
    "Posting data to EmonCMS": "Registrazione dei dati in EmonCMS",
    "The EmonCMS HTTP input API provides three ways of sending data to EmonCMS:": "L'API di input HTTP EmonCMS offre tre modalità di invio dei dati a EmonCMS:",
    "<b>input\/post<\/b> - Post a single update from a node as either one data item or as a JSON data structure.": "<b>input\/post:<\/b> consente di eseguire il post di un singolo aggiornamento da un nodo come elemento di dati o come struttura di dati JSON.input\/post - Post a single update from a node as either one data item or as a JSON data structure.",
    "<b>input\/bulk<\/b> - Bulk upload historic data from multiple nodes in a single update.": "<b>input\/bulk:<\/b> caricamento bulk di dati cronologici da più nodi in un unico aggiornamento.",
    "<b>encryption<\/b> - An encrypted version of both of the above.": "<b>crittografia<\/b> - Una versione crittografata di entrambe le versioni precedenti.",
    "If you're starting out with EmonCMS, 'input\/post' is a good starting point for testing. This was emonCMS' original input method. The EmonPi\/EmonBase uses the 'input\/bulk' input method to post to a remote EmonCMS server as that method provides an option to efficiently upload buffered data after an internet connection outage. Combining multiple updates in a single input\/bulk request also reduces bandwidth requirements. ": "Se stai iniziando con EmonCMS, 'input\/post' è un buon punto di partenza per il test. Questo era il metodo di input originale di emonCMS. EmonPi\/EmonBase utilizza il metodo di input 'input\/bulk' per inviare a un server EmonCMS remoto poiché tale metodo fornisce un'opzione per caricare in modo efficiente i dati memorizzati nel buffer dopo un'interruzione della connessione Internet. La combinazione di più aggiornamenti in una singola richiesta di input\/massa riduce anche i requisiti di larghezza di banda.",
    "For applications where HTTPS or TLS is not available, EmonCMS offers an in-built transport layer encryption solution where the EmonCMS apikey is used as the pre-shared key for encrypting the data with AES-128-CBC.": "Per le applicazioni in cui HTTPS o TLS non è disponibile, EmonCMS offre una soluzione di crittografia del livello di trasporto integrata in cui l'apikey EmonCMS viene utilizzata come chiave precondivisa per crittografare i dati con AES-128-CBC.",
    "input\/post": "ingresso\/post",
    "The <b>fulljson<\/b> format is recommended for new integrations. It uses the PHP JSON decoder and the answer is also in json.": "Il formato <b>fulljson<\/b> è consigliato per le nuove integrazioni. Usa il decodificatore JSON PHP e la risposta è anche in json.",
    "The <b>json like<\/b> format is based on the CSV input parsing implementation and maintained for backward compatibility.": "Il formato <b>json like<\/b> si basa sull'implementazione dell'analisi dell'input CSV e mantenuto per garantire la compatibilità con le versioni precedenti.",
    "The <b>node<\/b> parameter can be an unquoted string e.g: emontx or a number e.g: 10.": "Il parametro <b>node<\/b> può essere una stringa senza virgolette, ad esempio: emontx o un numero, ad esempio: 10.",
    "Time is set as system time unless a <b>time<\/b> element is included. It can be either a parameter &time (unquoted) or as part of the JSON data structure. If both are included the parameter value will take precedence. Time is a UNIX timestamp and can be in seconds or a string PHP can decode (ISO8061 recommended). If you are having problems, ensure you are using seconds not milliseconds. If part of the JSON data structure is a string, the node value will report NULL": "L'ora viene impostata come ora di sistema, a meno che non venga incluso un elemento <b>time.<\/b> Può essere un parametro &gt; o come parte della struttura di dati JSON. Se entrambi sono inclusi, il valore del parametro avrà la precedenza. Time è un timestamp UNIX e può essere in secondi o una stringa che PHP può decodificare (ISO8061 consigliato). Se si verificano problemi, assicurarsi di utilizzare secondi e non millisecondi. Se parte della struttura di dati JSON è una stringa, il valore del nodo riporterà NULL",
    "The input\/post API is compatible with both GET and POST request methods (POST examples given use curl).": "L'API input\/post è compatibile con entrambi i metodi di richiesta GET e POST (esempi POST che includono curl).",
    "Description": "Descrizione",
    "HTTP Method": "Metodo HTTP",
    "Example": "Esempio",
    "JSON format": "Formato JSON:",
    "JSON format - with time (as a string in this example)": "Formato JSON - con ora (come stringa in questo esempio)JSON format - with time (as a string in this example)",
    "JSON like format": "Formato JSON come",
    "CSV format": "Formato CSV",
    "Set the input entry time manually": "Impostare manualmente l'ora di immissione",
    "Node name as sub-action": "Nome nodo come sotto-azione",
    "To post data from a remote device you will need to include in the request url your write apikey. This give your device write access to your emoncms account, allowing it to post data.": "Per pubblicare dati da un dispositivo remoto è necessario includere nell'URL della richiesta l'apichiave di scrittura. Questo dà al tuo dispositivo l'accesso in scrittura al tuo account emoncms, permettendogli di pubblicare dati.",
    "For example using the first json type request above just add the apikey to the end like this:": "Ad esempio, usando la prima richiesta di tipo json precedente basta aggiungere l'apikey alla fine in questo modo:For example using the first json type request above just add the apikey to the end like this:",
    "JSON format:": "Formato JSON:",
    "CSV format:": "Formato CSV:",
    "input\/bulk": "ingresso\/massa",
    "Efficiently upload multiple updates from multiple nodes.": "Carica in modo efficiente più aggiornamenti da più nodi.",
    "Method": "Metodo",
    "Example request:": "Esempio di richiesta:",
    "The first number of each node is the time offset (see below).": "Il primo numero di ogni nodo è l'offset temporale (vedere di seguito).",
    "The second number is the node id. This is the unique identifier for the wireless node.": "Il secondo numero è l'ID del nodo. Questo è l'identificatore univoco per il nodo wireless.",
    "All the numbers after the first two, are data values. The second node here (node 17) has two data values: 1437 and 3164.": "Tutti i numeri dopo i primi due, sono valori di dati. Il secondo nodo qui (nodo 17) ha due valori di dati: 1437 e 3164.",
    "Optional offset and time parameters allow the sender to set the time reference for the packets. If none is specified, it is assumed that the last packet just arrived. The time for the other packets is then calculated accordingly.": "I parametri di offset e tempo facoltativi consentono al mittente di impostare il riferimento temporale per i pacchetti. Se non viene specificato alcun pacchetto, si presuppone che l'ultimo pacchetto sia appena arrivato. Il tempo per gli altri pacchetti viene quindi calcolato di conseguenza.",
    "Legacy default format (4 is now, 2 is -2 seconds and 0 is -4 seconds to now):": "Formato predefinito legacy (4 è ora, 2 è -2 secondi e 0 è -4 secondi per ora):",
    "Time offset format (-6 is -16 seconds to now):": "Il formato di offset temporale (-6 è -16 secondi per ora):",
    "Sentat format: (useful for sending as positive increasing time index)": "Formato Sentat: (utile per l'invio come indice positivo dell'ora crescente)",
    "Absolute time format (-6 is 1387730121 seconds since 1970-01-01 00:00:00 UTC))": "Formato assoluto dell'ora (-6 è 1387730121 secondi dal 1970-01-01 00:00:00 UTC))",
    "Named feeds (similar to the main example but updates the keys \"data\" and \"anotherData\" for node 19)": "Feed denominati (simile all'esempio principale ma aggiorna le chiavi \"data\" e \"anotherData\" per il nodo 19)",
    "Legacy format:": "Formato legacy:",
    "Time offset format:": "Formato scostamento ora:",
    "Sentat format:": "Formato Sentat:",
    "Absolute time format:": "Formato assoluto dell'ora:",
    "Encryption": "Crittografia",
    "For applications where HTTPS or TLS is not available, EmonCMS offers an in-built transport layer encryption solution where the emoncms apikey is used as the pre-shared key for encrypting the data with AES-128-CBC.": "Per le applicazioni in cui HTTPS o TLS non è disponibile, EmonCMS offre una soluzione di crittografia del livello di trasporto integrata in cui l'apikey emoncms viene utilizzata come chiave precondivisa per crittografare i dati con AES-128-CBC.",
    "There is a PHP example of how to generate an encrypted request here: ": "C'è un esempio PHP di come generare una richiesta crittografata qui:",
    "Fetching inputs, updating meta data and other actions": "Recupero di input, aggiornamento dei metadati e altre azioni",
    "Input get": "Ingresso ottenere",
    "List all nodes and associated inputs:": "Elencare tutti i nodi e gli input associati:",
    "List inputs for specific node:": "Elencare gli input per un nodo specifico:List inputs for specific node:",
    "Fetch specific input from node:": "Recupera input specifico dal nodo:",
    "Input actions": "Input Azioni",
    "List of inputs with latest data": "Elenco degli ingressi con i dati più recenti",
    "Get inputs configuration (last time and value not included)": "Ottenere la configurazione degli ingressi (ultima ora e valore non inclusi)",
    "Set input fields": "Impostare i campi di input",
    "Delete an input": "Eliminare un input",
    "Clean inputs without a process list": "Pulire gli input senza un elenco di processiClean inputs without a process list",
    "Input process actions": "Azioni processo di input",
    "Get input process list": "Ottenere l'elenco dei processi di inputGet input process list",
    "Set input process list": "Impostare l'elenco dei processi di input",
    "Reset input process list": "Reimpostare l'elenco dei processi di input",
    "Delete Input": "Elimina Input",
    "Deleting an Input will lose it name and configured Processlist.<br>A new blank input is automatic created by API data post if it does not already exists.": "L'eliminazione di un input perderà il nome e configurato Processlist.<br>Un nuovo input vuoto viene creato automaticamente dal post di dati DELL'API se non esiste già.",
    "Are you sure you want to delete?": "Sei sicuro di volerlo cancellare?",
    "Inputs": "Inputs",
    "Cancel": "Annulla",
    "Edit Input": "Modifica ingresso",
    "Name": "Nome",
    "Save": "Salva",
    "Close": "Chiudi",
    "Save All": "Salva tutto",
    "Basic text only. Symbols allowed _-.@": "Solo testo di base. Simboli consentiti _-. @",
    "name": "name",
    "description": "descrizione",
    "ID": "ID",
    "Value": "Valore",
    "Time": "Orario",
    "Updated": "Aggiornato",
    "Configure your device here": "Configura il tuo dispositivo qui",
    "Show node key": "Mostra chiave nodo",
    "Configure device using device template": "Configurare il dispositivo usando il modello di dispositivoConfigure device using device template",
    "Configure Input processing": "Configurare l'elaborazione dell'inputConfigure Input",
    "Saving": "Salvataggio",
    "Collapse": "Riduci",
    "Expand": "Espandi",
    "Select all %s inputs": "Seleziona tutti gli ingressi %s",
    "Select all": "Seleziona tutto",
    "Input API Help": "Aiuto API Input",
    "Delete": "Elimina",
    "Edit": "Modifica",
    "Show device key": "Mostra chiave dispositivo",
    "No inputs created": "Nessun input creato",
    "Inputs are the main entry point for your monitoring device. Configure your device to post values here, you may want to follow the <a href=\"api\">Input API helper<\/a> as a guide for generating your request.": "Gli ingressi sono il punto di ingresso principale per il dispositivo di monitoraggio. Configura il tuo dispositivo per pubblicare i valori qui, puoi seguire <a href=\"api\">l'helper dell'API<\/a> di input come guida per generare la tua richiesta.",
    "New device": "Nuovo dispositivo",
    "Loading": "Caricamento",
    "Error setting processlist": "Elenco processi per l'impostazione degli errori",
    "Please install the device module to enable this feature": "Si prega di installare il modulo del dispositivo per abilitare questa funzione",
    "Edit the input's description.": "Edit the input's description."
}