Repository: emoncms/emoncms
Catalog: Modules/node/locale/*/LC_MESSAGES/messages.po
Languages: es_es

source: Node API Help
es_es: Ayuda de la API de gestión de nodos

source: Nodes
es_es: Nodos

source: This is an alternative entry point to inputs designed around providing flexible decoding of RF12b struct based data packets
es_es: Este es un punto de entrada alternativo diseñado para proporcionar una decodificación flexible de paquetes de datos basados en RF12b

source: Input processes are executed sequentially with the result being passed back for further processing by the next processor in the input processing list.
es_es: Los procesos de entrada se ejecutan secuencialmente. La salida de cada proceso pasa al siguiente, en el orden indicado en la lista de procesos de la entrada.

source: Order
es_es: Orden

source: Process
es_es: Proceso

source: Arg
es_es: Argumento

source: Actions
es_es: Acciones

source: Feed engine
es_es: Motor de fuente

source: Fixed Interval With Averaging
es_es: Intervalos fijos, con promedios

source: Fixed Interval No Averaging
es_es: Intervalos fijos, sin promedios

source: Variable Interval No Averaging
es_es: Intervalos variables, sin promedios

source: PHPTIMESTORE (Port of timestore to PHP)
es_es: PHPTIMESTORE (Port de timestore para PHP)

source: TIMESTORE (Requires installation of timestore)
es_es: TIMESTORE (requiere instalar timestore)

source: GRAPHITE (Requires installation of graphite)
es_es: GRAPHITE (Requiere instalar graphite)

source: MYSQL (Slow when there is a lot of data)
es_es: MYSQL (lento con muchos datos)

source: Select interval
es_es: Seleccione intervalo

source: hour
es_es: hora

source: Add
es_es: Añadir

source: No nodes detected yet
es_es: No se han detectado nodos

source: To use this module send a byte value csv string and the node id to:
es_es: Para usar este módulo envía una lista de valores separados por comas y el id de nodo usando una URL similar a la siguiente:

source: Node
es_es: Nodo

source: Node API
es_es: API para la gestión de nodos

source: Apikey authentication
es_es: Autenticación por clave de API

source: If you want to call any of the following actions when your not logged in, add an apikey to the URL of your request: &apikey=APIKEY.
es_es: Para ejecutar alguna de las siguientes acciones cuando no hay una sesión iniciada, es necesario añadir la clave de API (apikey) a la URL de la petición: &apikey=APIKEY.

source: Read only:
es_es: Sólo lectura:

source: Read & Write:
es_es: Lectura y escritura:

source: Posting data
es_es: Enviando información

source: With write apikey:
es_es: Con la clave API de escritura:
