Repository: emoncms/emoncms
Catalog: Modules/input/locale/*/LC_MESSAGES/messages.po
Languages: es_es

source: Log to feed
es_es: Enviar a una fuente

source: Power to kWh
es_es: Potencia a kWh

source: Power to kWh/d
es_es: Potencia a kWh/d

source: x input
es_es: x entrada

source: Wh increments to kWh/d
es_es: Incrementos de Wh a kWh/d

source: kWh to kWh/d (OLD)
es_es: kWh a kWh/d (ANTIGUO)

source: update feed @time
es_es: Actualizar fuente @tiempo

source: + input
es_es: + entrada

source: / input
es_es: / entrada

source: Accumulator
es_es: Acumulador

source: Histogram
es_es: Histograma

source: Daily Average
es_es: Media diaria

source: kWh to Power
es_es: kWh a potencia

source: - input
es_es: - entrada

source: kWh to kWh/d
es_es: kWh a kWh/d

source: Allow positive
es_es: Permitir positivo

source: Allow negative
es_es: Permitir negativo

source: Signed to unsigned
es_es: Con signo a sin signo

source: Max value
es_es: Valor máximo

source: Min value
es_es: Valor mínimo

source: + feed
es_es: + fuente

source: - feed
es_es: - fuente

source: * feed
es_es: * fuente

source: / feed
es_es: / fuente

source: Reset to ZERO
es_es: Poner a CERO

source: Wh Accumulator
es_es: Acumulador de Wh

source: Input
es_es: Entrada

source: Input API
es_es: API de entrada

source: Apikey authentication
es_es: Clave de autenticación

source: If you want to call any of the following actions when your not logged in, add an apikey to the URL of your request: &apikey=APIKEY.
es_es: Para ejecutar alguna de las siguientes acciones cuando no hay una sesión iniciada, es necesario añadir la clave de API (apikey) a la URL de la petición: &apikey=APIKEY.

source: Read only:
es_es: Sólo lectura:

source: Read & Write:
es_es: Lectura y escritura:

source: Available HTML URLs
es_es: Direcciones HTML disponibles

source: The input list view
es_es: La lista de entradas

source: This page
es_es: Esta página

source: Input processing configuration page
es_es: Configuración de la entrada:

source: Available JSON commands
es_es: Comandos JSON disponibles

source: To use the json api the request url needs to include <b>.json</b>
es_es: Para usar la API JSON la URL de petición tiene que incluir <b>.json</b>

source: Post data
es_es: Enviar datos

source: JSON format:
es_es: Formato JSON:

source: CSV format:
es_es: Formato CSV:

source: Assign inputs to a node group
es_es: Asignar entradas a un grupo de nodos

source: Set the input entry time manually
es_es: Establecer manualmente el tiempo de la entrada

source: APIKEY
es_es: Clave de API

source: To post data from a remote device you will need to include in the request url your write apikey. This give your device write access to your emoncms account, allowing it to post data.
es_es: Para enviar datos desde un dispositivo remoto, es necesario incluir la clave de API de escritura en la URL de la petición. De esta manera, el dispositivo tendrá acceso de escritura a la cuenta de emoncms.

source: For example using the first json type request above just add the apikey to the end like this:
es_es: Por ejemplo, usando la primera forma de petición JSON mostrada arriba es suficiente añadir la clave de API al final de la URL de la siguiente manera:

source: Bulk data
es_es: Cargas masivas de datos

source: You can provide data using bulk mode
es_es: Puedes proporcionar los datos usando un modo masivo

source: The first number of each node is the time offset (see below).
es_es: El primer número de cada nodo es el desplazamiento temporal (ver a continuación).

source: The second number is the node id, this is the unique identifer for the wireless node.
es_es: El segundo número es el identificador de nodo, que es el identificador único del nodo inalámbrico.

source: All the numbers after the first two are data values. The second node here (node 17) has two data values: 1437 and 3164.
es_es: Todos los números después del primero son valores de datos. En el ejemplo, el segundo nodo (nodo 17) tiene dos valores de datos: 1437 y 3164.

source: Optional offset and time parameters allow the sender to set the time reference for the packets. If none is specified, it is assumed that the last packet just arrived. The time for the other packets is then calculated accordingly.
es_es: Los parámetros opcionales offset y time permiten establecer la referencia de tiempo para los paquetes. Si no se indica ninguno, se asume que el último paquete llega en ese mismo instante. El tiempo para el resto de paquetes se ajusta proporcionalmente.

source: Legacy default format (4 is now, 2 is -2 seconds and 0 is -4 seconds to now):
es_es: Formato por defecto "clásico": (4 es ahora, 2 es -2 segundos y 0 es -4 segundos desde el momento de llegada):

source: Time offset format (-6 is -16 seconds to now):
es_es: Formato de desplazamiento temporal (-6 es -16 respecto al momento actual)

source: Sentat format: (useful for sending as positive increasing time index)
es_es: Formato sentat: (útil para enviar como positivo, incrementando el índice de tiempo)

source: Absolute time format (-6 is 1387730121 seconds since 1970-01-01 00:00:00 UTC))
es_es: Formato de tiempo absoluto (-6 es 1387730121 desde el 01/01/1970 UTC)

source: Input actions
es_es: Acciones de procesos de entrada

source: List of inputs
es_es: Lista de entradas

source: Delete an input
es_es: Borrar entrada

source: Input process actions
es_es: Acciones de procesos de entrada

source: Add an input process
es_es: Añadir un proceso de entrada

source: List input process list
es_es: Listado de la lista de procesos de entrada

source: Delete input process
es_es: Borrar proceso de entrada

source: Move input process
es_es: Mover proceso de entrada

source: Reset input process list
es_es: Inicializar la lista de procesos

source: Input API Help
es_es: Ver ayuda para el uso de la API

source: Inputs
es_es: Entradas

source: Input processes are executed sequentially with the result being passed back for further processing by the next processor in the input processing list.
es_es: Los procesos de entrada son ejecutados de manera secuencial y el resultado es pasado para ser procesado por el siguiente proceso de la lista de procesos de entrada.

source: Order
es_es: Ordenar

source: Process
es_es: Procesar

source: Arg
es_es: Argumento

source: Actions
es_es: Acciones

source: Add
es_es: Añadir

source: No inputs created
es_es: No existen entradas

source: Inputs is the main entry point for your monitoring device. Configure your device to post values here, you may want to follow the <a href="api">Input API helper</a> as a guide for generating your request.
es_es: Las entradas son el punto de entrada principal para los dispositivos de monitorización. Configure su dispositivo para enviar sus valores aquí. Puede seguir la <a href="api">ayuda del API de entradas</a> como guía para generar sus URLs de petición.

source: Node:
es_es: Nodo

source: Key
es_es: Clave

source: Name
es_es: Nombre

source: Process list
es_es: Lista de procesos

source: Last updated
es_es: Última actualización

source: Value
es_es: Valor
