Repository: emoncms/emoncms
Catalog: Modules/feed/locale/*/LC_MESSAGES/messages.po
Languages: ru_ru

source: Feed API
ru_ru: API Ленты

source: Apikey authentication
ru_ru: Аутентификация по API ключу

source: If you want to call any of the following actions when you're not logged in, you have the option to authenticate with the API key:
ru_ru: Если вы хотите вызвать любое из следующих действий когда вы не залогинены,у Вас есть возможность аутентифизироваться с API ключом

source: Append to your request URL: &apikey=APIKEY
ru_ru: Добавьте в конец вашего URL-запроса: &apikey=APIKEY

source: Use POST parameter: "apikey=APIKEY"
ru_ru: Используйте POST параметр: "apikey=APIKEY"

source: Add the HTTP header: "Authorization: Bearer APIKEY" e.g. curl http://127.0.0.1/emoncms/feed/value.json?id=1 -H "Authorization: Bearer APIKEY"
ru_ru: Добавьте HTTP заголовок: "Authorization: Bearer APIKEY" например curl http://127.0.0.1/emoncms/feed/value.json?id=1 -H "Authorization: Bearer APIKEY"

source: Read only:
ru_ru: Только чтение

source: Read & Write:
ru_ru: Чтение и Запись

source: The feed list view
ru_ru: Представление в виде списка каналов

source: This page
ru_ru: Текущая страница

source: To use the json api the request url needs to include .json
ru_ru: Для использования JSON API URL-адрес запроса должен включать .json

source: Read feed actions
ru_ru: Читать действия в канале

source: List feeds for authenticated user
ru_ru: Список каналов для аутентифицированного пользователя

source: List public feeds for the given user
ru_ru: Список общедоступных каналов для данного пользователя

source: Get feed field
ru_ru: Получить поле канала

source: Get all feed fields
ru_ru: Получить все поля канала

source: Get feed meta (PHPFina, PHPFiwa)
ru_ru: Получить метаданные канала (PHPFina, PHPFiwa)

source: Read feed data actions
ru_ru: Прочитать действия с данными канала

source: Last updated time and value for feed
ru_ru: Последнее обновлённое значение и время для канала

source: Last value of a given feed
ru_ru: Последнее значение для данного пользователя

source: Last value for multiple feeds
ru_ru: Последнее значение для нескольких каналов

source: Returns feed data
ru_ru: Возвращает данные канала

source: Returns histogram data
ru_ru: Возвращает данные гистограммы

source: Returns kwh consumed in a given power band using histogram data type
ru_ru: Возвращает количество кВт*ч, потребленное в заданном диапазоне мощности, с использованием типа данных гистограммы

source: Export CSV data (timeformat=1: provides date time string format)
ru_ru: Экспорт данных в CSV (timeformat=1: предоставляет строковый формат даты и времени)

source: Write feed data actions
ru_ru: Записать действия с данными канала

source: Insert new data point
ru_ru: Вставить новую точку данных

source: Update data point
ru_ru: Обновить точку данных

source: Delete data point
ru_ru: Удалить точку данных

source: Feed setup actions
ru_ru: Действия по настройке канала

source: Create new feed
ru_ru: Создать новый канал

source: Delete existent feed
ru_ru: Удалить существующий канал

source: Update feed field
ru_ru: Обновить поле канала

source: Return total engines size
ru_ru: Вернуть полный размер подсистемы хранения

source: Return buffer points pending write
ru_ru: Вернуть буферные точки, ожидающие записи

source: Virtual feed process actions
ru_ru: Действия процесса виртуального канала

source: Get feed process list
ru_ru: Получить перечень процессов канала

source: Set feed process list
ru_ru: Установить перечень процессов канала

source: Reset feed process list
ru_ru: Сбросить перечень процессов канала

source: Tag
ru_ru: Тэг

source: Feed ID
ru_ru: ID канала

source: Feed Interval
ru_ru: Интервал канала

source: Feed Start Time
ru_ru: Время запуска канала

source: Realtime
ru_ru: В режиме реального времени

source: Daily
ru_ru: Ежедневно

source: Feed API Help
ru_ru: Помощь по API канала

source: Feeds
ru_ru: Каналы

source: Collapse
ru_ru: Свернуть

source: Expand
ru_ru: Развернуть

source: Select all
ru_ru: Выбрать всё

source: Unselect all
ru_ru: Убрать выделенеие всего

source: Edit
ru_ru: Редактировать

source: Delete
ru_ru: Удалить

source: Download
ru_ru: Скачать

source: Graph view
ru_ru: Предстваление в виде графа

source: Process config
ru_ru: Конфигурация процесса

source: No feeds created
ru_ru: Нет созданных каналов

source: Feeds are where your monitoring data is stored. The route for creating storage feeds is to start by creating inputs (see the inputs tab). Once you have inputs you can either log them straight to feeds or if you want you can add various levels of input processing to your inputs to create things like daily average data or to calibrate inputs before storage. Alternatively you can create Virtual feeds, this is a special feed that allows you to do post processing on existing storage feeds data, the main advantage is that it will not use additional storage space and you may modify post processing list that gets applyed on old stored data. You may want the next link as a guide for generating your request:
ru_ru: Каналы - это место, где хранятся данные вашего мониторинга. Перед созданием Каналов хранилища – необходимо создать Входы (см. Вкладку входов). Имея входные данные, вы можете либо записывать их прямо в каналы, либо, если хотите, вы можете добавлять различные уровни обработки входных данных, например, среднесуточные данные или калибровать входные данные перед сохранением. В качестве альтернативы вы можете создавать виртуальные каналы, это специальный канал, который позволяет выполнять пост-обработку данных существующих каналов хранения, главное преимущество заключается в том, что он не будет использовать дополнительное пространство для хранения, и вы можете изменить список пост-обработки, который применяется к уже сохранённым данным. Вам может понадобиться следующая ссылка в качестве руководства для создания вашего запроса:

source: Feed API helper
ru_ru: Помощник API Канала

source: Refresh feed size
ru_ru: Обновить размер канала

source: New virtual feed
ru_ru: Новый вирутальный канал

source: Edit feed
ru_ru: Редактировать канал

source: Feed node:
ru_ru: Узел канала

source: Feed name:
ru_ru: Имя канала

source: Make feed public:
ru_ru: Сделать канал публичным

source: Feed Unit
ru_ru: Единица измерения канала

source: Other
ru_ru: Другое

source: Close
ru_ru: Закрыть

source: Save
ru_ru: Сохранить

source: CSV export
ru_ru: Экспорт в CSV

source: Select the time range and interval that you wish to export:
ru_ru: Выберете временной диапазон и интревал, который Вы хотите экспортировать:

source: Start date & time
ru_ru: Время и дата начала

source: End date & time
ru_ru: Время и дата конца

source: Interval
ru_ru: Интервал

source: 5s
ru_ru: 5с

source: 10s
ru_ru: 10с

source: 30s
ru_ru: 30с

source: 1 min
ru_ru: 1 мин.

source: 5 mins
ru_ru: 5 мин.

source: 10 mins
ru_ru: 10 мин.

source: 15 mins
ru_ru: 15 мин.

source: 30 mins
ru_ru: 30 мин.

source: 1 hour
ru_ru: 1 час

source: 6 hour
ru_ru: 6 часов

source: 12 hour
ru_ru: 12 часов

source: Weekly
ru_ru: Еженедельно

source: Monthly
ru_ru: Едемесечно

source: Annual
ru_ru: Ежегодный

source: Date time format
ru_ru: Формать даты и времени

source: Offset secs (for daily)
ru_ru: Смещение в сек. (для ежеденевного)

source: Selecting an interval shorter than the feed interval (or Auto) will use the feed interval instead. Averages are only returned for feed engines with built in averaging.
ru_ru: При выборе интервала короче, чем интервал канала (или Авто), будет использоваться интервал канала. Средние значения возвращаются только для подсистем хранения канала со встроенным усреднением.

source: Date time in excel format is in user timezone. Offset can be set if exporting in Unix epoch time format.
ru_ru: Дата и время в формате Excel указывается в часовом поясе пользователя. Смещение может быть установлено при экспорте в формате времени Unix.

source: Estimated download size:
ru_ru: Оцениваемый скачиваемый обём:

source: Export
ru_ru: Экспортирование

source: Delete feed
ru_ru: Удалить канал

source: Deleting a feed is permanent.
ru_ru: Удаление канала - необратимо.

source: Clear
ru_ru: Очистка

source: Empty feed of all data
ru_ru: Очистка канала от всех данных

source: Clear Data
ru_ru: Удалить данные

source: Trim
ru_ru: Обрезать

source: Empty feed data up to
ru_ru: Удалить данные канала до

source: Set to the start date
ru_ru: Установить дату начала

source: Start
ru_ru: Начало

source: One year ago
ru_ru: Год назад

source: - 1 year
ru_ru: - 1 год

source: Two years ago
ru_ru: Два года назад

source: - 2 year
ru_ru: - 2 года

source: Set to the current date/time
ru_ru: Установить текущую дату/время

source: Now
ru_ru: Сейчас

source: Trim Data
ru_ru: Обрезать данные

source: If you have Input Processlist processors that use this feed, after deleting it, review that process lists or they will be in error, freezing other Inputs. Also make sure no Dashboards use the deleted feed.
ru_ru: Если у вас есть обработчики входов, которые используют этот канал, после его удаления просмотрите эти списки процессов, иначе они будут выдавать ошибку, заморозив другие входы. Также убедитесь, что никакие панели управления не используют удаленный канал.

source: This is a Virtual Feed, after deleting it, make sure no Dashboard continue to use the deleted feed.
ru_ru: Данный канал виртуальный - после его удаления убедитесь, что ни одна панель мониторинга не использует удальнённый канал.

source: Delete feed permanently
ru_ru: Удалить канал навсегда

source: New Virtual Feed
ru_ru: Новый виртуальный канал

source: Feed Name:
ru_ru: Имя канала:

source: Feed Tag:
ru_ru: Тэг канала:

source: Feed DataType:
ru_ru: Тип данных канала:

source: Cancel
ru_ru: Отменить

source: Unable to rename multiple feeds
ru_ru: Не возможно переименовать несколько каналов

source: 1 Input process associated with this feed
ru_ru: 1 Вход связан с этим каналом

source: %s Input processes associated with these feeds
ru_ru: %s Входов связано с этим каналом

source: %s Feeds selected
ru_ru: %s каналов выбрано

source: Out of range
ru_ru: Выход за пределы диапазона

source: This is a new feature. Consider backing up your data before you continue. OK to continue?
ru_ru: Это новая функция. Сделайте резевную копию Ваших данных перед тем как продолжить. Продолжить?

source: "Trim" not available for this storage engine
ru_ru: "Обрезка данных" не доступна для этой подсистемы хранения

source: Are you sure you want to delete all the feeds data?
ru_ru: Вы уверены что хотите удалить все данные канала?

source: "Clear" not available for this storage engine
ru_ru: "Удаление" не доступно для этой подсистемы хранения

source: Are you sure you want to delete?
ru_ru: Вы уверены что хотите удалить?

source: Feeds Deleted
ru_ru: Каналы удалены

source: Total size of used space for feeds:
ru_ru: Общий размер использованого места для канала:

source: Please enter a valid start date.
ru_ru: Пожалуйста, введите действительную начальную дату

source: Please enter a valid end date.
ru_ru: Пожалуйста, введите действительную конечную дату

source: Start date must be further back in time than end date.
ru_ru: Начальная дата должна быть раньше по времени чем конечная.

source: Please select interval to download.
ru_ru: Пожалуйста, выберете интервал для скачивания.

source: Estimated download file size is large.
ru_ru: Большой оцениваемый размер скачиваемого файла.

source: Server could take a long time or abort depending on stored data size.
ru_ru: Это может занять много времени у сервера или прекратить работу в зависимости от размера данных.

source: Limit is
ru_ru: Предел

source: Try exporting anyway?
ru_ru: Попытаться экспортировать в любом случае?

source: Invalid proccess for Virtual Feed, try another.
ru_ru: Не верный процесс для Виртуального канала, попробуйте другой

source: Invalid feed
ru_ru: Не верный канал

source: Cannot use virtual feed as source
ru_ru: Невозможно использовать вирутальный канал как источник

source: Invalid input
ru_ru: Не верный вход

source: Error setting processlist
ru_ru: Ошибка при настройке списка процессов
