{
    "If !schedule, ZERO": "Os !amserlen, SERO",
    "Schedule": "Amserlen",
    "If !schedule, NULL": "Os !amserlen, NULL",
    "If schedule, ZERO": "Os amserlen, SERO",
    "If schedule, NULL": "Os amserlen, NULL",
    "Schedule Help": "Cymorth Amserlen",
    "Schedules": "Amserlenni",
    "No schedules": "Dim amserlenni",
    "New schedule": "Amserlen newydd",
    "Delete schedule": "Dileu amserlen",
    "Deleting a schedule is permanent.": "Mae dileu amserlen yn barhaol.",
    "If you have an Input or Feed Processlist that use this schedule, after deleting it, review that process list or it will be in error freezing other process lists.": "Os oes gennych Restr Broses Mewnbwn neu Ffrwd sy'n defnyddio'r amserlen hon, ar ôl ei dileu, adolygwch y rhestr broses honno neu bydd mewn gwall yn rhewi rhestrau prosesau eraill.",
    "Are you sure you want to delete?": "Ydych chi'n siŵr eich bod am ddileu?",
    "Cancel": "Canslo",
    "Delete permanently": "Dileu'n barhaol",
    "Name": "Enw",
    "Expression": "Mynegiad",
    "Public": "Cyhoeddus",
    "Schedule API": "API Amserlen",
    "Apikey authentication": "Dilysu allwedd API",
    "If you want to call any of the following actions when your not logged in you have this options to authenticate with the API key:": "Os ydych eisiau galw unrhyw un o'r gweithredoedd canlynol pan nad ydych wedi mewngofnodi mae gennych yr opsiynau hyn i ddilysu â'r allwedd API:",
    "Append on the URL of your request: &apikey=APIKEY": "Ychwanegu at URL eich cais: &apikey=APIKEY",
    "Read only:": "Darllen yn unig:",
    "Read & Write:": "Darllen ac Ysgrifennu:",
    "Available HTML URLs": "URLau HTML sydd ar gael",
    "The schedule list view": "Golwg rhestr amserlenni",
    "This page": "Y dudalen hon",
    "Available JSON commands": "Gorchmynion JSON sydd ar gael",
    "To use the json api the request url needs to include <b>.json<\/b>": "I ddefnyddio'r api json mae angen i url y cais gynnwys <b>.json<\/b>",
    "Schedule process actions": "Gweithredoedd proses amserlen",
    "List schedules": "Rhestru amserlenni",
    "Get schedule details": "Cael manylion amserlen",
    "Get only the expression": "Cael y mynegiad yn unig",
    "Add a schedule": "Ychwanegu amserlen",
    "Update schedule": "Diweddaru amserlen",
    "Test the expression": "Profi'r mynegiad",
    "Expression documentation": "Dogfennaeth mynegiad",
    "Expression is used to specify active range.": "Defnyddir mynegiad i bennu ystod weithredol.",
    "Granularity is day light saving time, month, day, week day, hour and minute.": "Gronynnedd yw amser cynilo golau dydd, mis, diwrnod, diwrnod wythnos, awr a munud.",
    "Expression is built mixing basic blocks with operation characters. An hour is always required. All other basic blocks are optional and can be mixed on the same expression to build complex schedule rules. Ranges must be ordered older-newer. White spaces are ignored and can be ommited.": "Mae mynegiad yn cael ei adeiladu drwy gymysgu blociau sylfaenol â nodau gweithrediad. Mae awr bob amser yn ofynnol. Mae'r holl flociau sylfaenol eraill yn ddewisol a gellir eu cymysgu ar yr un mynegiad i adeiladu rheolau amserlen cymhleth. Rhaid trefnu ystodau yn hŷn-newydd. Mae bylchau gwyn yn cael eu hanwybyddu a gellir eu sgipio.",
    "Timezone of expression is the same of the user account that created or edited it. If the expression is public, timezones conversions are automatic taken in account between owner and user.": "Mae cylchfa amser y mynegiad yr un fath â'r cyfrif defnyddiwr a'i creodd neu a'i golygodd. Os yw'r mynegiad yn gyhoeddus, mae trawsnewidiadau cylchfaoedd amser yn cael eu cymryd i ystyriaeth yn awtomatig rhwng perchennog a defnyddiwr.",
    "Basic blocks:": "Blociau sylfaenol:",
    "Operation characters:": "Nodau gweithrediad:",
    "Expression examples:": "Enghreifftiau mynegiad:",
    "<p>Validates if time is NOT in range of schedule. If NOT in schedule, value is ZEROed.<\/p><p>You can use this to get a feed for each of the multi-rate tariff rate your provider gives. Add the 'Reset to Original' process before this process to log the input value to a different feed for each schedule on the same processing list<\/p>": "<p> Yn dilysu os nad yw amser yn ystod yr amserlen. Os NID yn yr amserlen, mae gwerth yn cael ei osod i SERO.<\/p><p>Gallwch ddefnyddio hyn i gael ffrwd ar gyfer pob un o'r cyfraddau tariff aml-gyfradd y mae eich darparwr yn eu rhoi. Ychwanegwch y broses 'Ailosod i'r Gwreiddiol' cyn y broses hon i gofnodi gwerth y mewnbwn i ffrwd wahanol ar gyfer pob amserlen ar yr un rhestr brosesu<\/p>",
    "<p>Validates if time is NOT in range of schedule. If NOT in schedule, value is NULLed.<\/p><p>You can use this to get a feed for each of the multi-rate tariff rate your provider gives. Add the 'Reset to Original' process before this process to log the input value to a different feed for each schedule on the same processing list<\/p>": "<p> Yn dilysu os nad yw amser yn ystod yr amserlen. Os NID yn yr amserlen, mae gwerth yn cael ei osod i NULL.<\/p><p>Gallwch ddefnyddio hyn i gael ffrwd ar gyfer pob un o'r cyfraddau tariff aml-gyfradd y mae eich darparwr yn eu rhoi. Ychwanegwch y broses 'Ailosod i'r Gwreiddiol' cyn y broses hon i gofnodi gwerth y mewnbwn i ffrwd wahanol ar gyfer pob amserlen ar yr un rhestr brosesu<\/p>",
    "<p>Validates if time is in range of schedule. If in schedule, value is ZEROed.<\/p><p>You can use this to get a feed for each of the multi-rate tariff rate your provider gives. Add the 'Reset to Original' process before this process to log the input value to a different feed for each schedule on the same processing list<\/p>": "<p> Yn dilysu os yw amser yn ystod yr amserlen. Os yn yr amserlen, mae gwerth yn cael ei osod i SERO.<\/p><p>Gallwch ddefnyddio hyn i gael ffrwd ar gyfer pob un o'r cyfraddau tariff aml-gyfradd y mae eich darparwr yn eu rhoi. Ychwanegwch y broses 'Ailosod i'r Gwreiddiol' cyn y broses hon i gofnodi gwerth y mewnbwn i ffrwd wahanol ar gyfer pob amserlen ar yr un rhestr brosesu<\/p>",
    "<p>Validates if time is in range of schedule. If in schedule, value is NULLed.<\/p><p>You can use this to get a feed for each of the multi-rate tariff rate your provider gives. Add the 'Reset to Original' process before this process to log the input value to a different feed for each schedule on the same processing list<\/p>": "<p> Yn dilysu os yw amser yn ystod yr amserlen. Os yn yr amserlen, mae gwerth yn cael ei osod i NULL.<\/p><p>Gallwch ddefnyddio hyn i gael ffrwd ar gyfer pob un o'r cyfraddau tariff aml-gyfradd y mae eich darparwr yn eu rhoi. Ychwanegwch y broses 'Ailosod i'r Gwreiddiol' cyn y broses hon i gofnodi gwerth y mewnbwn i ffrwd wahanol ar gyfer pob amserlen ar yr un rhestr brosesu<\/p>",
    "There are no public schedules and you have not created your own yet. Please add a new schedule.<br><br>For help and examples on how to configure a schedule, read the <a href=\"api#expression\">Expression documentation<\/a>.": "Nid oes amserlenni cyhoeddus a nid ydych wedi creu eich rhai eich hun eto. Ychwanegwch amserlen newydd.<br><br>Am gymorth ac enghreifftiau ar sut i ffurfweddu amserlen, darllenwch y <a href=\"api#expression\">Dogfennaeth Mynegiad<\/a>.",
    "Use POST parameter: \"apikey=APIKEY\"": "Defnyddio paramedr POST: \"apikey=APIKEY\"",
    "Add the HTTP header: \"Authorization: Bearer APIKEY\"": "Ychwanegu'r pennyn HTTP: \"Authorization: Bearer APIKEY\""
}