{
    "Schedule API": "API Planification",
    "Apikey authentication": "Authentification clé API",
    "If you want to call any of the following actions when your not logged in you have this options to authenticate with the API key:": "Si vous souhaitez appeler une des actions suivantes alors que vous n'êtes pas connecté, vous pouvez vous authentifier avec votre clé API",
    "Append on the URL of your request: &apikey=APIKEY": "Veuillez ajouter votre clé d'API à la fin de l'url : &apikey=APIKEY",
    "Use POST parameter: \"apikey=APIKEY\"": "Utilisez le paramètre POST \"apikey=APIKEY\"",
    "Add the HTTP header: \"Authorization: Bearer APIKEY\"": "Ajoutez l'en-tête HTTP : \"Authorization: Bearer APIKEY\"",
    "Read only:": "Lecture uniquement :",
    "Read & Write:": "Lecture & Écriture :",
    "Available HTML URLs": "URLs HTML disponibles",
    "The schedule list view": "La vue de la liste des planifications",
    "This page": "Cette page",
    "Available JSON commands": "Commandes JSON disponibles",
    "To use the json api the request url needs to include <b>.json<\/b>": "Pour utiliser l'api json, vous devez ajouter .json à la fin de l'url",
    "Schedule process actions": "Actions de traitement des planifications",
    "List schedules": "Lister les planifications",
    "Get schedule details": "Obtenir les détails de la planification",
    "Get only the expression": "Obtenir uniquement l'expression",
    "Add a schedule": "Ajouter une planification",
    "Delete schedule": "Supprimer une planification",
    "Update schedule": "Mettre à jour une planification",
    "Test the expression": "Tester l'expression",
    "Expression documentation": "Documentation de l'expression",
    "Expression is used to specify active range.": "L'expression est utilisée pour spécifier une plage active.",
    "Granularity is day light saving time, month, day, week day, hour and minute.": "La granularité est l'heure d'été, le mois, le jour, le jour de la semaine, l'heure et les minutes.",
    "Expression is built mixing basic blocks with operation characters. An hour is always required. All other basic blocks are optional and can be mixed on the same expression to build complex schedule rules. Ranges must be ordered older-newer. White spaces are ignored and can be ommited.": "L'expression est construite en mélangeant des blocs de base avec des caractères d'opération. Une heure est toujours requise. Tous les autres blocs de base sont facultatifs et peuvent être mélangés dans la même expression pour créer des règles de planification complexes. Les plages doivent être triées des plus anciennes aux plus récentes. Les espaces sont ignorés et peuvent être omis.",
    "Timezone of expression is the same of the user account that created or edited it. If the expression is public, timezones conversions are automatic taken in account between owner and user.": "Le fuseau horaire de l'expression est identique au compte d'utilisateur qui l'a créé ou modifié. Si l'expression est publique, les conversions de fuseaux horaires sont automatiquement pris en compte entre le propriétaire et l'utilisateur.",
    "Basic blocks:": "Blocs de base :",
    "Operation characters:": "Caractères d'opération : ",
    "Expression examples:": "Exemples d'expression :",
    "Schedule Help": "Aide Planification",
    "Schedules": "Planifications",
    "No schedules": "Pas de planifications",
    "There are no public schedules and you have not created your own yet. Please add a new schedule.<br><br>For help and examples on how to configure a schedule, read the <a href=\"api#expression\">Expression documentation<\/a>.": "Il n'y a pas de planifications publiques et vous n'avez pas encore créé la vôtre. S'il vous plaît ajoutez une nouvelle planification.<br><br>Pour obtenir de l'aide et des exemples sur la façon de configurer une planification, lisez la <a href=\"api#expression\">documentation de l'expression<\/a>.",
    "New schedule": "Nouvelle planification",
    "Deleting a schedule is permanent.": "La suppression d'une planification est permanente.",
    "If you have an Input or Feed Processlist that use this schedule, after deleting it, review that process list or it will be in error freezing other process lists.": "Si vous avez une Source ou un Flux qui utilise cette planification, après la suppression de la Source ou du Flux, examinez cette liste de traitement sinon elle sera en erreur et gèlera les autres listes de traitement.",
    "Are you sure you want to delete?": "Êtes-vous sûr de vouloir supprimer?",
    "Cancel": "Annuler",
    "Delete permanently": "Supprimer de façon permanente",
    "Name": "Nom",
    "Expression": "Expression",
    "Public": "Public",
    "Schedule": "Planification",
    "If !schedule, ZERO": "If !schedule, ZERO",
    "<p>Validates if time is NOT in range of schedule. If NOT in schedule, value is ZEROed.<\/p><p>You can use this to get a feed for each of the multi-rate tariff rate your provider gives. Add the 'Reset to Original' process before this process to log the input value to a different feed for each schedule on the same processing list<\/p>": "<p>Valide si le temps n'est PAS dans la plage de la planification. Si PAS dans la planification, la valeur est mise à ZERO.<p><p>Vous pouvez l'utiliser pour obtenir un flux pour chacun des taux tarifaires multi-taux que votre fournisseur vous donne. Ajoutez le processus \"Reset to Original\" avant ce processus pour consigner la valeur d'entrée dans un flux différent pour chaque planification de la même liste de traitement.<\/p>",
    "If !schedule, NULL": "If !schedule, NULL",
    "<p>Validates if time is NOT in range of schedule. If NOT in schedule, value is NULLed.<\/p><p>You can use this to get a feed for each of the multi-rate tariff rate your provider gives. Add the 'Reset to Original' process before this process to log the input value to a different feed for each schedule on the same processing list<\/p>": "<p>Valide si le temps n'est PAS dans la plage de la planification. Si PAS dans la planification, la valeur est mise à NULL.<p><p>Vous pouvez l'utiliser pour obtenir un flux pour chacun des taux tarifaires multi-taux que votre fournisseur vous donne. Ajoutez le processus \"Reset to Original\" avant ce processus pour consigner la valeur d'entrée dans un flux différent pour chaque planification de la même liste de traitement.<\/p>",
    "If schedule, ZERO": "If schedule, ZERO",
    "<p>Validates if time is in range of schedule. If in schedule, value is ZEROed.<\/p><p>You can use this to get a feed for each of the multi-rate tariff rate your provider gives. Add the 'Reset to Original' process before this process to log the input value to a different feed for each schedule on the same processing list<\/p>": "<p>Valide si le temps est dans la plage de la planification. Si dans la planification, la valeur est mise à ZERO.<p><p>Vous pouvez l'utiliser pour obtenir un flux pour chacun des taux tarifaires multi-taux que votre fournisseur vous donne. Ajoutez le processus \"Reset to Original\" avant ce processus pour consigner la valeur d'entrée dans un flux différent pour chaque planification de la même liste de traitement.<\/p>",
    "If schedule, NULL": "If schedule, NULL",
    "<p>Validates if time is in range of schedule. If in schedule, value is NULLed.<\/p><p>You can use this to get a feed for each of the multi-rate tariff rate your provider gives. Add the 'Reset to Original' process before this process to log the input value to a different feed for each schedule on the same processing list<\/p>": "<p>Valide si le temps est dans la plage de la planification. Si dans la planification, la valeur est mise à NULL.<p><p>Vous pouvez l'utiliser pour obtenir un flux pour chacun des taux tarifaires multi-taux que votre fournisseur vous donne. Ajoutez le processus \"Reset to Original\" avant ce processus pour consigner la valeur d'entrée dans un flux différent pour chaque planification de la même liste de traitement.<\/p>"
}