Repository: emoncms/emoncms
Catalog: Modules/user/locale/*/LC_MESSAGES/messages.po
Languages: ru_ru

source: Bookmarks
ru_ru: Закладки

source: You can bookmark any page you're on by clicking the star icon (top right)
ru_ru: Вы можете заложить любую страницу кликнув на иконку звезы (вверху справа)

source: Rename or remove your bookmarks
ru_ru: Переименовать или удалить ваши закладки

source: Save
ru_ru: Сохранить

source: Cancel
ru_ru: Отменить

source: Edit
ru_ru: Редектировать

source: Delete
ru_ru: Удалить

source: Username
ru_ru: Пользователь

source: Password
ru_ru: Пароль

source: Confirm password
ru_ru: Подтвеждение пароля

source: Login
ru_ru: Залогиниться

source: or
ru_ru: или

source: register
ru_ru: зарегистрироваться

source: Register
ru_ru: Регистрация

source: My account
ru_ru: Мой аккаунт

source: User ID
ru_ru: ID пользователя

source: Change Password
ru_ru: Сменить пароль

source: Current password
ru_ru: Текущий пароль

source: New password
ru_ru: Новый пароль

source: Repeat new password
ru_ru: Повторите новый парель

source: Write API Key
ru_ru: Записать ключ API

source: Copy
ru_ru: Копировать

source: Read API Key
ru_ru: Прочитаь ключ API

source: Delete my account
ru_ru: Удалить мой аккаунт

source: Mobile app
ru_ru: Мобильное приложение

source: Scan QR code from the iOS or Android app to connect:
ru_ru: Просканируйте QR код из приложения iOS или Android для соединения:

source: Or using a barcode scanner scan to view MyElectric graph
ru_ru: Или исппользуя сканер штрих-кода просканируйтеч для просмотра графика MyElectic

source: My Profile
ru_ru: Мой профиль

source: Please update your database
ru_ru: Пожалуйста обновите вашу базу данных

source: WARNING deleting an account is permanent
ru_ru: ОСТОРОЖНО! удаление аккаунта не обратимо

source: Are you sure you want to delete your account?
ru_ru: Вы уверены что хотите удалить аккаунт?

source: Your account has been successfully deleted.
ru_ru: Ваш аккаунт успешно удалён.

source: Confirm password to delete:
ru_ru: Подтвердите паролем удаление:

source: Delete permanently
ru_ru: Удалить не обратимо

source: Logout
ru_ru: Выход

source: Name
ru_ru: Имя

source: Location
ru_ru: Расположение

source: Bio
ru_ru: Биография

source: Timezone
ru_ru: Временная зона

source: Language
ru_ru: Язык

source: Starting page
ru_ru: Стартовая страница

source: Passwords do not match
ru_ru: Пароль не совпадает

source: Preference Saved
ru_ru: Настройки сохранены

source: Problem saving Preferences
ru_ru: Проблемы сохранения настроек

source: Invalid parameters
ru_ru: Неверные параметры

source: Error getting data
ru_ru: Ошибка получения данных

source: Empty
ru_ru: Пусто

source: Add Bookmark
ru_ru: Добавить закладку

source: Apps
ru_ru: Приложения

source: My Account
ru_ru: Мой аккаунт

source: Missing username, password or email parameter
ru_ru: Пропущено имя пользователя, пароль или email

source: Username must only contain a-z and 0-9 characters
ru_ru: Имя пользователя может содержать только символы a-z и 0-9

source: Username already exists
ru_ru: Пользователья с таим именем уже существует

source: Email address format error
ru_ru: Email не соответсвует формату

source: Username length error
ru_ru: Ошибка длинны имени пользователя

source: Password length error
ru_ru: Ошибка длинны пароля

source: Error creating user, mysql error:
ru_ru: Ошибка создания пользователя, ошибка mysql:

source: Invalid username
ru_ru: Не правильное имя пользователя

source: Database error, you may need to run database update
ru_ru: Обишка базы данных, возможно вам следует запустить обновление базы данных

source: Username does not exist
ru_ru: Пльзователь не существут

source: Email already verified
ru_ru: Email уже веревицировать

source: Email verification email sent, please check your inbox
ru_ru: Письмо верификации почты послано, пожалуйста проверьте Входящие

source: Invalid verification key
ru_ru: Не верный ключ верификации

source: Username or password empty
ru_ru: Имя пользователя или пароль пусты

source: Username must only contain a-z 0-9 dash and underscore, if you created an account before this rule was in place enter your username without the non a-z 0-9 dash underscore characters to login and feel free to change your username on the profile page.
ru_ru: Имя пользователя должно содержать только a-z 0-9 дефис и подчеркивание. Если вы создали учетную запись до того, как это правило вступило в силу, введите свое имя пользователя без знаков, отличных от a-z 0-9 подчеркивания дефис, для входа и не стесняйтесь изменять свое имя пользователя на странице профиля.

source: Please verify email address
ru_ru: Пожалуйста, верифицируйте email адресс

source: Incorrect password, if you're sure it's correct try clearing your browser cache
ru_ru: Неверный пароль, если вы уверены в его корректности - почистите кэш вашего браузера

source: Error creating rememberme cookie, try login without rememberme
ru_ru: Ошибка создания файла cookie "запомнить меня", попробуйте войти без него

source: Login successful
ru_ru: Вход выполнен успешено

source: Username must only contain a-z 0-9 dash and underscore
ru_ru: Имя пользователя может содержать a-z 0-9 дефис и подчёркивание

source: Incorrect authentication
ru_ru: Аутентификация не удалась

source: Old password incorect
ru_ru: Старый пароль не верен

source: As you are using a cookie based remember me login, please logout and log back in to change username
ru_ru: Поскольку вы используете логин на основе куки-файлов, выйдите из системы и войдите снова, чтобы изменить имя пользователя.

source: Username updated
ru_ru: Имя пользователя обновлено

source: As you are using a cookie based remember me login, please logout and log back in to change email
ru_ru: Поскольку вы используете логин на основе куки-файлов, выйдите из системы и войдите снова, чтобы изменить адрес электронной почты

source: Email updated
ru_ru: Email обновлён

source: Error updating user info
ru_ru: Ошибка обновления информации о пользователе

source: Please update database
ru_ru: Пожалуйста обновите базу данных
